[
    {
        "id": 1,
        "FirstName": "Frederick",
        "MiddleInitial": "H.",
        "LastName": "Barner",
        "Suffix": "",
        "Birthdate": "07/20/1860",
        "DateOfDeath": "03/21/1909",
        "Department": "Pueblo Police Department",
        "DatesOfService": "1908-1909",
        "PhotoFile": "Barner_Frederick.jpg",
        "Biography": "Frederick House Barner was born in Susquahanna Township, Juniate County, Pennsylvania on July 20, 1860. He married Edith C. Sell in Pueblo on October 17, 1888. Frederick worked as a conductor for the Santa Fe and Denver and Rio Grande Railroads before he joined the Pueblo Police Department in 1908. He was survived by his wife and three boys, Roy 17, Joseph, 15, and Carl, 11; parents Joseph and Sarah (House) Barner of Sioux Falls, South Dakota; five sisters and one brother.",
        "Incident": "Patrolman Frederick Barner, 48, was shot and killed at 10th Street and North Main on Sunday night, March 21, 1909. Officer Barner had arrested two men near 10th and Grand and walked them to the police call box on Main. As he opened the box to call for the patrol wagon, one of the men stepped back, drew a gun and shot Barner one time in the chest. The men fled east on 10th Street and disappeared in the vacant lots near the Grand Hotel. Detective Gray heard the shot and was at the scene within minutes. He found Barner dead from a shot through the heart.<br></br>Pueblo police officers were called out and a search for the suspects started. Many men were rounded up but eventually released for lack of evidence. Police believe that Barner had possibly captured two members of a gang that had been burglarizing residences along Grand Avenue. One strong suspect, Felis Martinez, was arrested and charged. Witnesses identified him by his description and a hat that was found at the scene. The weak part of this arrest was the determination that Barner was shot with a .41 caliber bullet and Martinez was carrying a .38 caliber revolver.<br></br>Las Animas County Undersheriff Kreegar came to Pueblo and interviewed Martinez and determined that he was probably innocent of the killing. Martinez was later released, and no one was ever convicted in the death of Officer Barner.",
        "Sources": "Pueblo Police Department<br></br>Pueblo Chieftain - Mar 22-29, 1909<br></br>Ancestry - Library Edition"
    },
    {
        "id": 2,
        "FirstName": "Leide",
        "MiddleInitial": "W.",
        "LastName": "DeFusco",
        "Suffix": "",
        "Birthdate": "09/15/1968",
        "DateOfDeath": "08/31/2012",
        "Department": "Pueblo County Sheriff's Office",
        "DatesOfService": "1990 - February 1995, returned January 2007 - August 31, 2012",
        "PhotoFile": "DeFusco_Leide.jpg",
        "Biography": "Leide William DeFusco was born September 15, 1968, in Pueblo and graduated from South High School in 1986. He attended Trinidad State Junior College, earned an associate degree in criminal justice and served as student body president. He became a deputy with the Pueblo County Sheriff's Department in 1990 where he stayed until February 1995 when he was hired by the Pueblo Police department. He worked patrol and served as a field training officer, defensive tactics instructor, narcotics detective and SWAT team member.<br></br>On January 17, 2007, Captain DeFusco left the police department and returned to the Pueblo County Sheriff's Office. His responsibilities included command over patrol deputies, the narcotics unit, officers working at Colorado State University at Pueblo campus, and the SWAT team. He was also a firearms and use of force tactics instructor. He was remembered as a leader, friend and mentor to all who knew him, and praised for being a family man and a loving son, brother, husband and father.<br></br>He was survived by his wife Wendy, children, Ashton, Kaylee, Michael and Amanda, his mother Judy: his brothers Christopher and Marc; sister Mianna Sorensen; father and mother in-laws Gus and Sue Sandstrom; nieces, nephews, uncles and other family and friends. A Memorial service was held on September 7 at Praise Assembly of God Church in Pueblo. His remains were cremated.",
        "Incident": "Captain Leide DeFusco, 43, died in an airplane crash on August 31, 2012, while attempting to locate illegal marijuana grows in the San Isabel National Forest. DeFusco was working as an aerial marijuana spotter. The pilot of the plane was John A. Barger, 64, a retired Pueblo Police captain, who also died in the crash. Law enforcement officers had raided two illegal marijuana operations in the Wet Mountains on August 15. DeFusco and Barger were looking for additional grows and had arrived in the area at about 9:30 a.m. Radio contact with the plane was lost at 9:40 a.m. and a search began. The crash site was found just after 7 p.m. several miles below St. Charles Peak, in southeast Custer County. Both died on impact.<br></br><i>The Pueblo Chieftain</i> identified the airplane as a single-engine Piper Super Cruiser owned by Barger. The National Transportation Safety Board (NTSB) and the Pueblo County Sheriff's Office handled the investigation. The year of the plane, tail number and cause of the crash were not released.",
        "Sources": "Sheriff Kirk Taylor, Pueblo County Sheriff's Office<br></br>Pueblo Chieftain: Sept. 1, 4, 2012<br></br>Ancestry -- Library edition"
    },
    {
        "id": 3,
        "FirstName": "John",
        "MiddleInitial": "W.",
        "LastName": "Dunleavy",
        "Suffix": "",
        "Birthdate": "06/01/1868",
        "DateOfDeath": "07/25/1909",
        "Department": "Pueblo Police Department",
        "DatesOfService": "Unknown",
        "PhotoFile": "Dunleavy_John.jpg",
        "Biography": "John W. Dunleavy was born in England in June of 1868. He immigrated to the USA in 1891 and married Minnie Knape in Pueblo, on January 19, 1892. He sold cigars before he joined the Pueblo Police Department. John was survived by his wife and four children, Edward, 20, Frank, 15, Edith, 12, and Mary, 8: sister Mrs. R. Ryan of Pittsburgh and his brother Edwin.<br></br>Services were held on July 28 at St. Francis Xavier Church at Spruce and Logan. Mayor Fugard, a large contingent of police officers, firemen and city officials attended. Many friends and members of lodges that Dunleavy was a member of were also present. The city council passed a resolution honoring Dunleavy noting that he was \"<i>Brave in life....and surpassingly (sic) so in death.</i>\" Burial followed at Roselawn Cemetery.",
        "Incident": "Detective Sergeant John Dunleavy, 41, was shot and mortally wounded in the 1500 block of Pine just before 11:00 p.m. on July 21, 1909. He died from his wounds at 2:30 a.m., July 25. Dunleavy had finished his shift and while walking home, picked up his daughter from a friend's house when they were approached by two men. One made an insulting comment to Dunleavy's daughter and Dunleavy stepped forward putting her behind him. Dunleavy was then shot, fell to the ground and fired five times at the fleeing men, with no apparent effect. Dunleavy was rushed to Minnequa Hospital. Night Captain Charles Yund went to the hospital to get descriptions of the men and ordered all the detectives to Bessemer for a police dragnet.<br></br>Pueblo Police Chief Sullivan was notified and passed on the descriptions to other departments in the state and to the railroads. Dunleavy's partner that night was Detective Columbo Delliquadri. Just an hour or so earlier Delliquadri had stepped on a stone and sprained his ankle. Dunleavy assisted him to the streetcar line eight blocks away and then finished his shift alone. Investigators believed that the men that shot Dunleavy were planning to ambush both detectives and that Delliquadri's sprained ankle had kept him away from the attack. Detective Sergeant Dunleavy had earned a reputation for suppressing gambling and enforcing liquor laws in Bessemer. He was also responsible for the pawn shops in the area and recovered many stolen items. Chief Sullivan stated that Dunleavy had received \"<i>many 'Black Hand' letters threatening his life if he didn't let up on arresting people out his way.</i>\"<br></br>It was determined at the hospital that Dunleavy had been shot three times, in the leg, hip and just below the heart. Surgery was performed but the injures were too severe, and he died three days and three hours after being shot. At least 20 suspects were picked up by the police and all were eventually released. No one was ever convicted for the murder of Detective Sergeant Dunleavy.",
        "Sources": "Pueblo Police Department<br></br>Pueblo Chieftain - July 22 - 28, 1909<br></br>Ancestry - Library Edition"
    },
    {
        "id": 4,
        "FirstName": "Thomas",
        "MiddleInitial": "J.",
        "LastName": "Evans",
        "Suffix": "",
        "Birthdate": "01/1857",
        "DateOfDeath": "09/13/1919",
        "Department": "Pueblo Police Department",
        "DatesOfService": "Unknown",
        "PhotoFile": "Evans_Thomas.jpg",
        "Biography": "Thomas Jefferson (Jeff) Evans was born in Kansas Territory (probably in Olathe, Johnson County) in January of 1857. He married his wife Tranquill in 1893, and they had three children. He lived at 1237 Bragdon Street and had worked for the Pueblo Police several times in the past and had recently rejoined the force. The funeral was held on Tuesday at the Whiton Chapel, and the body of Officer Evans was then escorted to the depot where it was taken by train to Lamar. He was buried the same day at the Riverside Cemetery in Lamar, next to his wife, who had died 16 years earlier. Jeff Evans was survived by his three children: Harry R. Evans, 25, of Canon City, Mrs. Julia Evans Kulp, 23 of Pueblo and Mrs. Frances Evans McKinsie, 19, of Denver.<br></br>The coroner's jury met again on Thursday (18th) to try and determine who was involved in the lynching. The Mexican government was represented to Senor A.J. Ortiz and attorney Ed J. Stark as counsel. Both Gonzales and Ortez were Mexican citizens. Seventeen witnesses testified but no one was able to identify anyone that took part in the affair. The coroner's jury was adjourned until September 30 at the request of Senor Ortiz in case some identity evidence might be discovered. No new information was discovered, and the coroner's jury issued the following statement: \"<i>We, the jury, find that Jose Gonzales and Salvador Ortez came to their deaths on September 13, 1919, by being hung by their necks in Pueblo County, Colorado, by persons unknown to this jury.</i>\" According to author Steve Leonard, this was the last lynching in Colorado.",
        "Incident": "Pueblo Patrolman Jeff Evans, 62, was shot and killed about 1:00 a.m. on Saturday, September 13, 1919, while walking his beat in the 500 block of West Second street in an area known as the \"Peppersauce Bottoms\". He apparently heard the cries of a woman who was quarreling with two men and came upon the scene from the alley. A brief conversation may have ensued before Evans was struck in the back of the head, knocked to the ground, then shot in the chest by the other man. Mr. & Mrs. Claude Hudson witnessed the shooting and stated that the two men were \"Mexicans\", drunk and had run off. Pueblo police Night Captain Jack Sinclair called out every available officer and detectives. Officer Evans was found on his back with his revolver near his hand. He had died almost instantly as the coroner determined that the bullet had cut the aorta and lodged in his back near the spine. Pueblo officers searching the Colorado-Kansas railroad station found three men sleeping in a passenger coach. All three were taken to the Hudson home on Second Street where they positively identified one of the men but said they had never seen the other two men. Officer John Miller had remained at the rail yard out of sight and a short time later found the other suspect hiding in the coach, wet to the waist because he had been hiding in the weeds until the other officers left. The second suspect had a revolver and 40 rounds of ammunition when arrested, was positively identified by the Hudson's and then jailed. The two \"Mexicans\" were part of a six-man section crew for the railroad that worked the daily train to Stone City.<br></br>Both suspects (Jose Gonzales & Salvadore Ortez) were in custody before daylight and the community was outraged by the murder of Officer Evans. Pueblo Chief of Police Daly said that the men denied everything at first, then admitted to being at the Hudson home but stated they were so drunk they did not know what they had done. The fate of the prisoners changed dramatically that evening. About 9:00 p.m., that evening the police received a call of a riot in the 1700 block of Schley Ave. Nigh Captain Sinclair, with a wagon load of officers rushed to Bessemer, leaving Desk Sergeant Garfield McCafferty alone at the city jail (in the \"old city hall\") with the city health officer. About 9:10 p.m. a \"mob\" of 50-100 approached the jail, disarmed a Pueblo officer nearby then pointed their guns through a window at the sergeant and the health officer. Holding them at gunpoint, others entered and obtained the jail keys then found the prisoners sleeping in a cell. Both were knocked unconscious, bound and \"<i>dragged out of the jail into automobiles and the mob proceeded at break-neck speed up Grand Avenue to Fourth Street and down west Fourth Street to the bridge.</i>\" The prisoners had ropes placed around their necks and then were thrown off the bridge over the waters of the Arkansas River. The mob dispersed. Meanwhile the police wagon realized that the riot call was a fake and returned to the jail to find out what had happened. They found the two victims of the lynching about 45 minutes later where a crowd then gathered while the officers waited for the coroner. In fact, officers had to move the crowd from the bridge for fear that the bridge would collapse. It was reported that this occurred during a driving rainstorm: and that it was very dark due to cloud cover. Sgt. McCafferty and the health officer both stated that the men wore hats or caps pulled down low to their eyes and blue or red handkerchiefs over their faces so they could not be recognized. The few words spoken were in a rasping voice and not identifiable either. Grover Shoup and Pueblo County Sheriff Thomas stated that they would... \"<i>ferret out and punish...the leaders of the vigilance committee which hung the two Mexicans last night.</i>\"<br></br>The coroner's jury met on Monday and Acting Coroner Mahar and Assistant DA Langdon conducted an investigation including interviews with four witnesses. They reached the following verdict: \"<i>Patrolman Jeff Evans came to his death on the night of September 13, 1919, at 508 West Second Street, Pueblo, Colorado, from the effects of a gunshot wound inflicted by Jose Gonzales after deceased had been felled to the ground by a blow delivered by Salvator Ortez and said blow and said gunshot were inflicted with felonious intent.</i>\"",
        "Sources": "Pueblo Police Department<br></br>The Pueblo Chieftain - Sep 13-19, Oct 1, 3, 1919<br></br>Prowers County News - Sep 19, 1919<br></br>Ancestry - Library Edition<br></br>US Census - 1860, 1900, 1910<br></br>Leonard, Steven J. Lynching in Colorado 1859-1919, Boulder: University Press of Colorado, 2002"
    },
    {
        "id": 5,
        "FirstName": "Frances",
        "MiddleInitial": "I.",
        "LastName": "Galvin",
        "Suffix": "",
        "Birthdate": "03/11/1942",
        "DateOfDeath": "05/25/1979",
        "Department": "Colorado State Patrol -- Troop 2A",
        "DatesOfService": "1977 - 1979",
        "PhotoFile": "Galvin_Frances.jpg",
        "Biography": "Frances Irene (Edwards) Galvin was born on March 11, 1942, in Neosho, Kansas. She graduated from Erie High School in Erie, Kansas and worked as a nurse before joining the Colorado State Patrol on October 10, 1977, as a cadet. She worked briefly in Golden, then spent seven months at the Colorado Springs patrol office. She started the patrol Academy on May 15, 1978, and was assigned to the Pueblo Troop on August 16, 1978.<br></br>She was divorced and survived by her three children, Dana Lynn Hewitt, 16, Denise Leann Hewitt, 14, and Thomas Alan Hewitt, 11; her parents Cecil & Gladys Edwards of Erie, Kansas; two brothers, five sisters, and other relatives and friends. Service was held on May 27, at McCarthy Chapel in Pueblo. Interment followed at East Hill Cemetery in Erie, Kansas.",
        "Incident": "Trooper Frances (Fran) Galvin, 37 died at 1:40 p.m. on Friday, May 25, 1979, from injuries received in an auto-pedestrian accident the night before at the scene of a fatal auto motorcycle crash on Highway 50 and Lane 25, east of Pueblo. Galvan was finishing her accident report in her patrol car when she stepped outside for one more measurement. She stepped into the eastbound left lane and was struck by a car driven by John Pfeiffer, 30, of Pueblo. She was rushed to St. Mary Corwin Hospital in Pueblo where she underwent surgery and was placed in intensive care. She died there 15 hours after being struck.<br></br>Lieutenant Don Lamb determined that no charges would be filed against Pfeiffer since there was no evidence of excessive speed or any other factors to justify charges. Sergeant John Williams was still at the scene and would have held oncoming traffic for her, but she didn't say anything to him before she went to get the measurement.<br></br>The accident she was sent to investigate happened at about 9 p.m. when a motorcycle struck the rear of a car that had stopped to make a left-hand turn from the eastbound left lane of Highway 50. The 20-year-old motorcyclist was thrown over the car 54 feet. Slid another 74 feet on the pavement and died at the scene. The driver and passenger in the car received minor injuries. The crash scene was cleared by 10:20 p.m. The fire department and most other first responders had left the scene and all lanes were reopened. Galvin and Williams remained to finish their investigation.",
        "Sources": "Colorado State Patrol - By Keith Dameron, Historian - Colorado Law Enforcement Memorial<br></br>Pueblo Chieftain & Star-Journal: May 26, 28, 1979<br></br>Ancestry - Library Edition"
    },
    {
        "id": 6,
        "FirstName": "William",
        "MiddleInitial": "W.",
        "LastName": "Green",
        "Suffix": "",
        "Birthdate": "01/1857",
        "DateOfDeath": "10/15/1918",
        "Department": "Pueblo County Sheriff's Office",
        "DatesOfService": "Six months",
        "PhotoFile": "Green_William.jpg",
        "Biography": "William Wesley Green was born in January, 1857, in Lafayette County, Missouri and married Mary Fida Wagoner there on January 23, 1878. He served with the Pueblo Police Department for nearly 25 years before retiring as a detective in early 1918. He then was hired by the Pueblo County Sheriff's Office as a turnkey just six months before his death, He was survived by his wife and son Charles of Pueblo, daughter Myrtle (Dr. Haley) Marshal, grandson Ronald of Harrington, Kansas and his brother Judge Henry Green of Odessa, Missouri.",
        "Incident": "Deputy William W. Green, 61, was working as a jailer or turnkey on October 15, 1918, when he was shot and killed by prisoner Clifford Sproul, 23, at 3:15 p.m. after Sproul's wife was allowed to bring him a change of clothes and basket of food. Green was escorting him back to his cell, when Sproul struck him on the back of the head and shot him as he fell. Sproul ran to the entrance and ordered the other turnkey, Joe Vetere, to unlock the gate. The unarmed Vetere did as he was told, and Sproul escaped.<br></br>Green had shouted when the attack occurred but was unconscious by the time Vetere got to him. He had a large gash on the back of his head and a bullet would just below his heart. He died 20 minutes later, before an ambulance arrived. Vetere stated that Deputy Green had examined the basket and clothing for weapons or prohibited items, but none were found. Sproul had just been sentenced to 4-8 years for burglary of the Elks Club and was a suspect in other business burglaries.<br></br>He was seen running from the jail and reported to be in a barn on 12th Street between Blake and Conley, about 6 blocks from the jail. Sheriff Britt and City Electrician Dotson climbed into the loft of the barn and found Sproul when the sheriff stepped on him in the hay. Detectives Baty and Walton, Undersheriff Grady and Mounted Officer Lovern were also searching the loft. Sproul was reportedly thrown from the loft to the men waiting below. When he was searched, a revolver and several shells were found in a specially made, concealed pocket in one leg of his trousers. According to his statement, killing Deputy Green was not his intention, he just wanted to escape. Sproul's wife Mattie was arrested for bringing the gun, but she denied doing so. Sproul stated he had received it from someone else several days before and denied that his wife had brought him the gun and that she knew nothing about his plan to escape.<br></br>The shooting aroused the people of Pueblo. A newspaper headline stated, \"Mobs Form to Lynch Negro; Spirited Away\". Sheriff Britt, the undersheriff and two U.S. Marshals transported Sproul to Colorado Springs due to the crowd sentiment after the shooting occurred. The article went on to say that \"...a mob of 75 persons appeared at the jail and demanded the negro be surrendered to them. Jailer Bradley told the mob that Sproul was not there, and to prove his statement, told them to appoint a committee to search the jail. This was done, and after the committee had inspected all departments of the immense jail, they reported to the crowd, which soon dispersed.\" Mattie Sproul was apparently not charged in this case.<br></br>Clifford Sproul was convicted of Murder and sentenced to \"death by hanging.\" He arrived in Canon City on March 18, 1919, and became prisoner #10671. His execution was scheduled in late June of 1919, but Governor Oliver H. Shoup commuted the sentences of Sproul and two other death row inmates to life in prison. Prison records indicated that he was born in Mississippi, lived in Pueblo and had previously served time in prison in Lansing, Kansas. His nickname was \"Dick the Digger\" due to his skill at digging through brick and stone walls into offices and strong rooms. He died in the prison hospital on October 17, 1920, at the age of 25. Prison records do not record the cause of death.",
        "Sources": "Sheriff Kirk Taylor and Deputies Mike Fetterhoff and Jason Guagliardo, Pueblo County Sheriff's Office<br></br>Pueblo Chieftain, Oct 16, 17, 1918; Oct 15, 2011.<br></br>Summit County Journal: Oct 19, 1918<br></br>Museum of Colorado Prisons<br></br>Ancestry - Library Edition"
    },
    {
        "id": 7,
        "FirstName": "Thomas",
        "MiddleInitial": "M.",
        "LastName": "Hanson",
        "Suffix": "",
        "Birthdate": "09/19/1936",
        "DateOfDeath": "12/29/1973",
        "Department": "Pueblo Police Department",
        "DatesOfService": "1966 - 1973",
        "PhotoFile": "Hanson_Thomas.jpg",
        "Biography": "Thomas M. Hanson was born September 19, 1936. He grew up in Delta, Colorado where his father, Harold Hanson, served on the police force for 18 years, retiring as the Chief of Police. Tom served in the National Guard from May 1953 to June 1959. He worked in Uravan and Montrose before joining the Delta Police Department in November 1962 where he stayed for nearly four years. He then did some machine shop work before joining the Pueblo Police Department on October 25, 1966. Tom was promoted to Corporal on January 12, 1972. He was survived by his wife Karen S. Hanson of Pueblo and five children, Kim Lori, Kriby Leigh and Jamie Jo Hanson, all of Delta; and Thomas Kelly and Zorrin Scott Hanson of the family home in Pueblo; also, by his mother Mrs. Frances G. Hanson of Pueblo and brother James of Delta. Services were held on December 31 at the McCarthy Funeral Home with burial following at Roselawn Cemetery. Over 400 people attended, half of which were police officers.<br></br>On January 2, Chief Bud Willoughby announced that the department's recently renovated training facility had been named Hanson Hall in memory of Corporal Thomas M. Hanson. He said that each new officer, and officers undergoing in-service training, will recognize that a fellow officer laid down his life for the people of Pueblo, and that a plaque acknowledging this would be hung in the training academy.",
        "Incident": "Corporal Thomas Hanson, 37, was shot and killed about 1:45 a.m. on Saturday, December 29, 1973, when he interrupted an armed robbery at a 7-11 store at Ninth and Grand, in Pueblo. Hanson and his partner, Officer James Askey, stopped at the 7-11 so Cpl. Hanson could buy a carton milk. Hanson entered the store while Askey remained in the patrol car. Unknown to the officers, a young man, later identified as Bernard Meehan, 19, was hiding behind one of the food shelves in the corner of the store. Officer Askey spotted the suspicious movements of Meehan, as the suspect approached Hanson near the counter. Meehan came up behind Hanson as the officer approached the counter and fired one round as Hanson turned toward him. Askey jumped from the cruiser and fired two rounds at Meehan just seconds after Cpl. Hanson fell to the floor. Meehan then staggered toward the door with his gun still in his hand. He turned toward Askey, was shot again and fell to the floor in front of the magazine display. Cpl. Hanson was rushed to Parkview Episcopal Hospital where he was pronounced dead at 2:15 a.m. Meehan arrived at the hospital a few minutes after Hanson was admitted and died three hours later. Deputy Coroner, Dr. John Howe said that the postmortem indicated that Hanson was killed by a .22 caliber bullet that entered a lung, severed a large blood vessel then entered the other lung and lodged in the torso. Pueblo Police spokesman John Ercul said that all three of Askey's shots struck Meehan. Both store clerks were laying on the floor behind the counter, which they had been told to do before Cpl. Hanson entered the store.<br></br>Investigators determined that another subject was involved and located him about 20 hours after the shooting. He was identified as Charles D. Salazar, 17, who had dropped out of Centennial High School. Salazar was jailed and subsequently indicted for murder in the death of Cpl. Hanson. He was alleged to have been the driver of \"get-away\" vehicle during the robbery with Meehan. Bond was set for $50,000 by District Judge Matt Kikel. No further information was found on Salazar's case.",
        "Sources": "Pueblo Police Department<br></br>Colorado Chieftain - Dec 30, 31; Jan 1,2,3,8, 1974<br></br>Delta County Independent - Dec 31, 1973"
    },
    {
        "id": 8,
        "FirstName": "Nicholas",
        "MiddleInitial": "K.",
        "LastName": "Heine",
        "Suffix": "",
        "Birthdate": "08/12/1977",
        "DateOfDeath": "06/21/2008",
        "Department": "Pueblo Police Department",
        "DatesOfService": "2001 - 2008",
        "PhotoFile": "Heine_Nicholas.jpg",
        "Biography": "Nicholas Karl Heine was born in Pueblo, Colorado, on August 12, 1977. He graduated from Central High School in 1995 and attended college at the University of Northern Colorado where he majored in music, playing the tuba, trombone, trumpet and drums. Later he decided to become a Pueblo police officer and started on January 8, 2001. Nick was survived by his wife Melissa, daughters Nichole, 7, and Rebecca, 4, mother Pat Heine, Father Tom (Maryann) Heine, brother Jason and numerous other relatives and friends.<br></br>Services were held on June 26 at Praise Assembly of God Church on Troy Avenue. Pueblo Police Chief Jim Billings officiated the service. An estimated 900 people attended, and the funeral procession included close to 200 vehicles including police cards, motorcycles, fire apparatus and ambulances. Interment was at Roselawn Cemetery in Blende.",
        "Incident": "Officer Nick Heine, 30, collapsed and died from a heart condition about 2:00 a.m., June 21, 2008. Officer Heine and other officers had been working multiple bar disturbances in the Historic Union Avenue District when they were dispatched to another fight at a place called Bongimo's. Nick and other officers took off on foot to the nearby bar. While running Nick told another officer he couldn't breathe then collapsed in the 300 block of Victoria Street. CPR was attempted at the scene and then for over two hours at Parkview Medical Center before he was pronounced dead about 5:00 a.m.<br></br>Pueblo County Coroner James Kramer later determined that Heine had a congenital heart defect that put his heart into a fatal, irregular rhythm. Officer Heine was in excellent health, and no one knew about the heart defect. It could have happened at any time but working in strenuous conditions appeared to have contributed to the heart condition. His mother, Corporal Pat Heine, also worked for the Pueblo Police Department.",
        "Sources": "Pueblo Police Department<br></br>Pueblo Chieftain - June 22-27, 2008<br></br>Denver Post - June 22, 2008"
    },
    {
        "id": 9,
        "FirstName": "Addison",
        "MiddleInitial": "O.",
        "LastName": "Hinsdale",
        "Suffix": "",
        "Birthdate": "12/27/1898",
        "DateOfDeath": "10/04/1920",
        "Department": "Pueblo Police Department",
        "DatesOfService": "Unknown",
        "PhotoFile": "Hinsdale_Addison.jpg",
        "Biography": "Addison Oliver Hinsdale was born December 27, 1898, in Colorado. He had worked at the steel mill and then was a truck driver before becoming a police officer. He was survived by his pregnant wife Lavina, parents Addison O. and Annie Hinsdale, and sisters Delores, 19, and Hortense, 13. The funeral was held on Friday, October 8 at the family residence, 227 Jefferson Street, and then at St. Patrick's Church. Burial was at Roselawn Cemetery, Pueblo Officers Osborn, Gwinn, Connors, Gray, Perkins, Bertagnolli and Jailer Olson served as pallbearers. The next day, October 9, Lavina gave birth to a daughter, Addie Arlene Hinsdale.",
        "Incident": "Pueblo Officer Addison Hinsdale, 21, was accidentally shot about 6:30 p.m. on October 3, 1920, and died from his wound the next afternoon, Monday, October 4, at 2:30 p.m. at St Mary's Hospital. The bullet went thru the stomach and liver and doctors believed that he might survive but complications set in, and he passed away twenty hours after being shot. The situation that led to the shooting was a traffic crash which occurred on the western approach of the Northern Avenue viaduct. A car driven by Halley Butcher was traveling west over the viaduct when he was struck by a car being driven by Scott Reed. Reed's vehicle came from a side street and up the wrong side of Northern Avenue when the collision occurred. Officer Hinsdale and Officer Charles Meyers both were walking their respective beats, heard the crash and ran towards the scene from opposite directions. Reed was attempting to extricate his vehicle from the Butcher vehicle and possibly flee the scene. Officer Meyers seeing the Reed vehicle driving away fired three shots, aiming at the tires, to try and stop the car. Officer Hinsdale was shot once with the bullet entering his stomach and exiting his back. The other two shots also missed the car. Mr. Butcher picked up Hinsdale and took him to St. Mary's Hospital. Reed was arrested and charged with reckless driving.<br></br>Pueblo Police Chief Daly suspended Officer Meyers while an investigation was conducted. Reed was brought into Municipal Court the morning of October 4, found guilty of reckless driving and fined the maximum of $300.00. Reed stated that he was driving away because he thought Butcher was shooting at him. Officer Meyers stated immediately after the shooting that he thought that Hinsdale had been hit by a shot from a rooming house on Northern Avenue, but detectives discounted that after investigation. It was determined that one of the rounds fired by Officer Meyers struck Officer Hinsdale.\"<i>Meyers also said he believed that Reed was attempting to escape from the law, and that he felt justified in shooting at the fleeing motorist.</i>\" The newspaper noted that both officers had just recently been appointed to the Pueblo police force and had not received their uniforms. Both officers were in plain clothes while working that day. It is not known if Officer Meyers kept his job with the Pueblo Police Department.",
        "Sources": "Pueblo Police Department<br></br>The Pueblo Chieftain - October 4,5,6,8, & 12, 1920<br></br>Ancestry - Library Edition"
    },
    {
        "id": 10,
        "FirstName": "William",
        "MiddleInitial": "F.",
        "LastName": "Langdon",
        "Suffix": "",
        "Birthdate": "04/05/1851",
        "DateOfDeath": "12/10/1915",
        "Department": "Atchison Topeka & Santa Fe Railway Police",
        "DatesOfService": "Two years",
        "PhotoFile": "Langdon_William.jpg",
        "Biography": "William Francis Langdon was born in Brooklyn, New York on April 5, 1851. He married a widow, Mary Lovica (Connelly) Dever on September 29, 1883, in Springfield, Missouri. He served in the U.S. Army for 12 years and then the U. S. Navy for several years. He was also a volunteer during the Spanish-American War. The family moved to Colorado before 1898 and he held several jobs which included working for the Pueblo Police Department, a guard at the CF&I Steel plant and as a guard at the state penitentiary in Canon City where he spent nine years. He had been with the Atchison Topeka and Santa Fe Railway Police for more than two years.<br></br>He was survived by his wife, two grown daughters, Martha and Carrie; and his stepdaughter, Grace Dever. Burial was at Mountain View Cemetery in Pueblo. Mary received a $500.00 insurance payment, and a lifetime pass on the railroad as compensation for his death in the line of duty. She also received $30.00 a month as a widow of a veteran of the Spanish-American War.",
        "Incident": "Special Agent William F. (Will) Langdon, 64, was shot and killed in the East Santa Fe railyards in Pueblo at about 4 p.m. on December 10, 1915, after he observed four trespassers or \"hobos\" near the Pueblo Smelter. He told the junction operator that the men looked like the escaped suspects he had been looking for. Langdon approached the men, searched two of them and then called the other two down from the embankment. One stayed behind the other when they came down and he pulled out a revolver and shot Langdon as he started to search them. The first bullet struck him in the head and the other rounds hit him in the chest, left arm and abdomen. He died within minutes. The autopsy determined that the head and chest wounds were fatal shots.<br></br>The first two trespassers remained at the scene but the other two fled to the east along the tracks. They passed the tower where they were spotted by two railroad employees, the telegraph operator and the tower man, who, having heard the shots, followed them. The Pueblo police were notified and all available officers responded as did a special agent of the Santa Fe Railway.<br></br>The railroad employees followed the fleeing men across the Fountain River, north to Second Street, then to a barn at 316 E. Second Street. They reported where the men were hiding. Pueblo Police Chief Daly, Detective Grady and Patrolman McGovern searched the loft and found them hiding under hay. The suspects gave their names as Charles Lewis and Frank Williams. A further search of the loft by Detectives W. W. Green and Walton recovered a Luger semi-automatic pistol along with two .38-caliber revolvers, more than 200 rounds of ammunition and several bank bags. One of the guns, a blue steel .38-Army Colt, had been fired five times with one round still in the cylinder.<br></br>It was later determined that the real names of the pair were Joe Kitterman (alias Lewis), 27, and Lige Higgins (alias Williams), 39, who were wanted for three bank robberies in Kansas and Oklahoma. Kitterman was identified as the shooter by the tower man. The first two hobos who were not involved were later released. More specific information learned in the following days said that Kitterman and Higgins had been involved in three recent bank robberies in Chautauqua and Niotaze, Kansas, and Fort Gibbons, Oklahoma. They had been living at 1014 Cedar in Pueblo for three weeks.<br></br>The jury trial began on Monday, February 14, 1916, with Judge J. E. Rizer presiding and Deputy District Attorney Hughes prosecuting. Jury selection took three days. Testimony began on Thursday, and it was revealed that Langdon also carried a Pueblo County deputy sheriff's commission. Pueblo County Sheriff John McKee attended the trial and was responsible for the prisoners before and after the court sessions.<br></br>The defense attorneys claimed that Higgins had nothing to do with the shooting of Langdon, that Kitterman didn't know Langdon as a law officer, and that he fired in self-defense. Two witnesses testified that an examination of Langdon's gun showed it had not been fired for at least a week prior to the shooting. The court did allow the warrants from Chautauqua County, Kansas to be admitted as evidence to show motive for shooting Langdon. The trial concluded on February 23 with Kitterman convicted of second-degree murder and Higgins of voluntary manslaughter. Kitterman received a sentence of 25-45 years and Higgins received a 5-8-year sentence.<br></br>Both arrived in Canon City on March 3, 1916. Kitterman, prisoner 9912, was discharged September 15, 1952, after his sentence was extended for two escapes, in 1920 and in 1942. Higgins, prisoner 9913, was paroled on December 3, 1919 and discharged from parole on May 23, 1921.",
        "Sources": "Burlington Northern Santa Fe Railway<br></br>The Pueblo Chieftain: December 11-13, 15, 17, 1915; January 7, 9, 11, 14, 25,; February15-23, 1916<br></br>The Santa Fe Employee's Magazine: January 1916<br></br>Museum of Colorado Prisons<br></br>Ancestry - Library Edition"
    },
    {
        "id": 11,
        "FirstName": "Moses",
        "MiddleInitial": "",
        "LastName": "Lovern",
        "Suffix": "",
        "Birthdate": "1848",
        "DateOfDeath": "05/11/1891",
        "Department": "Pueblo Police Department",
        "DatesOfService": "January - May 1891",
        "PhotoFile": "Lovern_Moses.jpg",
        "Biography": "John Moses Lovern was born in 1848, in Macon County, Missouri and was the oldest of 10 kids. He came to Colorado about 1880, lived in South Pueblo and worked for the Railway Mail Service in 1881. By 1883 he was a policeman in South Pueblo and later a foreman for Mills & Bennett. He was appointed to the Pueblo Police Department in January 1891, just five months before his death. The funeral was held on May 13 at the Methodist Episcopal Church and Pueblo police officers served as pallbearers. The funeral procession to the cemetery included the Fireman's band, the mayor and councilmen in carriages, a fire engine, a hook & ladder truck, hose wagons, the police patrol wagon and an escort of officers marching six abreast. The newspaper noted relatives of the deceased were in the procession, however none were identified. Burial was at Pueblo Pioneer Cemetery.",
        "Incident": "Officer Moses Lovern, 43, died from an accidental gunshot wound received about 10 hours earlier, on Monday, May 11, 1891, at 12:10 a.m., at Dr. McDonald's office in Pueblo. Officer Lovern was walking his beat the previous afternoon near Charles Longquest's Saloon on Union Avenue just north of the bridge, when he noticed something was wrong with his 'pistol belt'. It was just after 3:00 p.m., on May 10, when he entered the saloon to fix the problem. Lovern removed the belt, took the pistol from the scabbard and laid it on the glass cigar 'show' case. While he was working on the belt the pistol\" ...slipped off the slanting top of the case and in falling the hammer struck the projected edge of the counter and the pistol was discharged,\" Lovern was standing with his left side to the show case. The bullet went up cutting his coat and vest, through the coat collar and into Lovern's head just below the lobe of his left ear, shattering the base of his skull and tearing open the internal carotid artery, and exiting an inch and a half above and behind the ear. The bullet then passed through the corrugated iron ceiling and buried itself in the floor above.<br></br>The patrol wagon was summoned, and Officer Lovern was taken to Dr. McDonald's office. Pressure was kept on the ear to control the bleeding, and it was determined that the injury was fatal. The right side of his body was paralyzed and except for a brief moment just after the injury, he was unconscious the entire time. His family was summoned and with him when he died.",
        "Sources": "Pueblo Police Department - Dr. Luis Velez, Chief<br></br>Pueblo Daily Chieftain - May 11, 13, 14, 1891<br></br>Ancestry - Library Edition"
    },
    {
        "id": 12,
        "FirstName": "Silas",
        "MiddleInitial": "",
        "LastName": "Martz (Marts)",
        "Suffix": "",
        "Birthdate": "11/1859",
        "DateOfDeath": "10/07/1903",
        "Department": "Pueblo Police Department",
        "DatesOfService": "Unknown",
        "PhotoFile": "Martz_Silas.jpg",
        "Biography": "Silas Martz (Marts) was born in Ringgold County, Iowa, in November 1859, to Charles and Lucinda Martz. He married Cora Johnson in Colorado Springs on December 21, 1890. He was survived by his wife and daughter Myrtle, 12.<br></br>A double funeral ceremony Silas Martz (Marts) and Edwin Slater who were killed in the same incident was held on October 11 at the First Baptist Church at 9th and Court. Both were remembered for their dedication to duty and the love they showed to their families. Over 2,000 attended and it was noted that several hundred carriages were in the procession to Riverview Cemetery (not Roselawn Cemetery) where they were buried side by side.<br></br>Dr. Rice was so drunk that he didn't remember anything that occurred that evening. He apparently had a problem with alcohol for some time prior and had recently started adding cocaine and morphine to the mix. A trial was held in December and Rice's defense was 'temporary insanity'. A number of doctors testified to that, and Rice was found not guilty by a jury on December 31, 1903. Rice died from cancer in 1922 at the age of 63.",
        "Incident": "Officer Silas Martz (Marts), 43, was shot and killed on October 7, 1903, inside the Palace Drug store near 2nd and Main in Pueblo. Officer Marts was attempting to arrest Dr. Charles O. Rice, 44, who was drunk on alcohol and morphine and armed with a .45 caliber Colt revolver. About 8:00 p.m. Rice had become 'crazed'. He threatened the employees and customers and chased them from the store. A crowd estimated at 1000 people eventually gathered and the police held them back not knowing what Rice would do. Finally, about 9:30 p.m. Officers Marts and Daly entered the building and attempted to talk to Rice in a friendly manner. Dr. Rice waited until Marts was about 8' away and then fired one shot which struck Marts in the neck. With Daly's help, Marts was able to stagger out of the store and across the street. He was attended to immediately, but he died in the ambulance on the way to the hospital from a severed jugular vein.<br></br>Officer Elwin Slater was outside, and the crowd was jeering the police officers. Slater determined that he would sneak in and crawl around to where Dr. Rice was. About 9:45 p.m. he entered the store with his hand on his holstered gun. As he moved to a crouched position a gunshot was heard, and Slater was shot in the right leg. He was helped out of the drug store and taken to the hospital. Investigation afterward found that Slater had partially drawn his gun and accidentally shot himself when he crouched down. The bullet left a hole on the inside of his holster and entered his thigh which caused internal hemorrhaging. He died the next day, October 8, at 5:20 p.m. believing that he'd been shot by Dr. Rice, but that was not the case.<br></br>The drug store did not have a rear entrance and that hampered the efforts to capture Dr. Rice. Just before Officer Slater entered the store others were working on a different plan. Detective F. Rubichaud, Assistant Fire Chief Campbell and Firefighter Davenport had gained access to an adjoining business, went to the basement, removed a partition and found Dr. Rice passed out in the basement of the drug store. Rice was arrested and charged with murder. Dr. Rice had been the family physician for the Marts family for 12 years which may be why he thought he could talk Rice out of using the gun.",
        "Sources": "Pueblo Police Department<br></br>Pueblo Chieftain - Oct 8-20, 1903, and May 12, 2001<br></br>Deputy Chief Ronald A. Gravatt (retired) Pueblo PD. Research<br></br>Ancestry - Library Edition"
    },
    {
        "id": 13,
        "FirstName": "John",
        "MiddleInitial": "M.",
        "LastName": "McKee",
        "Suffix": "",
        "Birthdate": "03/1851",
        "DateOfDeath": "04/19/1918",
        "Department": "Pueblo County Sheriff's Office",
        "DatesOfService": "1914 - 1918",
        "PhotoFile": "McKee_John.jpg",
        "Biography": "John M. McKee was born in Pennsylvania in March of 1851, and moved to Pueblo before 1890, working as a machinist. He served in the Philippines during the Spanish-American War, leaving the service with the rank of first sergeant. He was elected county treasurer in 1900 and served until 1907. He was elected sheriff in 1914, re-elected in 1916 and was widely known throughout the state. He served in the Spanish War Association, Knights Templar-Pikes Peak Lodge and the Machinists Union. He was survived by his wife Mary and two brothers, James of New Bloomfield, Pennsylvania and Lynn of Aberdeen, South Dakota.",
        "Incident": "Sheriff John McKee, 67, died at 11 a.m. on Friday, April 19, 1918, from a paralytic stroke. He had worked the previous day but went home feeling ill and suffered the stroke the next morning. McKee had sustained a serious head injury nine months earlier when he and Undersheriff Sam Thomas arrested a man on a warrant for threatening violence.<br></br>On July 18, 1917, at about 4 p.m. McKee and Thomas went to the farm of Sam Vertrees, 60, about 20 miles southeast of Pueblo in the Huerfano District, on a complaint from Vertrees' nephew that he had made violent threats against neighbors and family members. They had a warrant to arrest Vertrees and were in his home when Vertrees attacked them. During the struggle Vertrees managed to grab the sheriff's revolver but was unable to fire it. He hit the sheriff on the head with the gun, bit him and kicked both the sheriff and undersheriff in the head. Thomas received several bruises and was kicked near his eye. McKee sustained a ruptured blood vessel in his head. Vertrees was wearing heavy hobnailed boots which worsened the head injury. The fight lasted nearly 30 minutes before the officers managed to subdue Vertrees. They took him to the \"county farm\" where he was held pending a sanity examination.<br></br>McKee never fully recovered from his injuries and was ill for months. He lost vision in his right eye and had seen a specialist in Denver several weeks prior to his death. An operation was performed but it did not help much. A newspaper story said that he had become impaired and that he was in a \"dangerous condition\" before he died.<br></br>Services were held on April 21 at the family home, 922 S. Union, with interment following at Roselawn Cemetery. It was estimated that 1,000 people attended and the funeral cortege was noted as one of the longest seen in Pueblo for many years.<br></br>Vertrees was confined to Colorado's insane asylum in Pueblo where he died on January 11, 1920.",
        "Sources": "Pueblo County Sheriff's Office<br></br>Pueblo Chieftain: Jul 20, Apr 20-23, 1918, Jan 18, 1920<br></br>Ancestry - Library Edition"
    },
    {
        "id": 14,
        "FirstName": "Norman",
        "MiddleInitial": "F.",
        "LastName": "Patterson",
        "Suffix": "",
        "Birthdate": "11/05/1851",
        "DateOfDeath": "08/06/1913",
        "Department": "Pueblo County Court Constable",
        "DatesOfService": "circa 1909 - 1913",
        "PhotoFile": "Patterson_Norman.jpg",
        "Biography": "Norman Fuller Patterson was born on November 5, 1851, in Buffalo, Missouri, and arrived in Pueblo in 1863, in a prairie schooner covered wagon. He was said to be \"one of the best-known pioneers of Pueblo County\" and \"and as a youth he saw much Indian fighting and many a buffalo has fallen prey to this rifle on the prairie about Pueblo.\" Patterson operated a ranch and dairy business at Avondale for many years before moving to Pueblo. Patterson had been a Pueblo Police Officer for several years before he was elected Constable. He had served as a Pueblo County Constable for over four years. His trip to Spokane would have been his first trip outside of Colorado since he arrived 50 years earlier.<br></br>He married Dora Bell Stephenson on July 4, 1878, and survived by her and their five children; John of Boulder and Birdie, Estole, Hazel and Letta of Pueblo; his mother, Nancy Patterson and sister, Mrs. Mary Bailey, both Spokane; sisters, Mrs. W. J. Arnold at Hayden's Lake and Mrs. Grant Ballou, of Portland.<br></br>The funeral service was held at the family home, 1210 Beulah Ave., on Monday, August 11. The Policeman's Benevolent Association and the Woodmen Of the World assisted with the services. The funeral procession was one of the longest seen in some time. Burial was at Mountain View Cemetery in Pueblo.",
        "Incident": "Constable Norman Patterson, 61, was shot and killed on Wednesday, August 6, 1913, in the Mint Saloon at 186 N. Union Avenue. Patterson worked in the court of Justice of the Peace, G. L. Seits and served civil papers. Earlier that day he had served a \"writ of ouster\" eviction on Frank Dolman. Dolman (or Dohlman) was a former Pueblo police officer and Patterson's friend. In fact, Patterson had recommended Dolman for a job as a night watchman for the Swift Block ruins. Where a major fire had burned an entire block. He had even loaned Dolman a gun so he could do the job.<br></br>The house from which Dolman was being evicted belonged to Max Stein, a Pueblo police mounted patrol officer. Stein had gone to court to get Dolman evicted from the house at 1106 E, First St. After serving the papers, Patterson asked Dolman to return the loaned gun. Dolman said he would leave it at the Mint Saloon later that day for Patterson to pick up. Dolman wanted Stein to meet him at the saloon too, but Stein would not.<br></br>Patterson then went to the Rio Grande railroad ticket office and purchased one or more tickets to Spokane, Washington, on a train scheduled to depart at 9:35 p.m. He was going on vacation to meet with other family members and celebrate the 50th anniversary of the Patterson family's arrival in Pueblo. After getting his ticket he went to the saloon at about 5 p.m.<br></br>Dolman was waiting in the back room with Patterson's gun wrapped in some papers. He had told others that the wrapped package contained a fish he was going to have for supper. However, he had taken the eviction harder than was thought, and when Patterson arrived he grabbed the gun and shot him through the heart and then in the back as he fell. He then shot himself in the head. Patterson died almost instantly while Dolman died four hours later without regaining consciousness at St. Mary Corwin Hospital. Investigators concluded that Dolman had wanted to shoot both Patterson and Stein. Courthouse officials reported that he had made threats against Undersheriff Warren Hill and Constable Bradley too.",
        "Sources": "Pueblo Police Department<br></br>The Pueblo Star-Journal : August 7-12, 1913<br></br>Pueblo Chieftain: August 7-12, 1913<br></br>Ancestry - Library Edition"
    },
    {
        "id": 15,
        "FirstName": "Alvin",
        "MiddleInitial": "P.",
        "LastName": "Phippenney",
        "Suffix": "",
        "Birthdate": "11/28/1847",
        "DateOfDeath": "06/30/1879",
        "Department": "Unknown",
        "DatesOfService": "1879 (Three weeks)",
        "PhotoFile": "Phippenney_Alvin.jpg",
        "Biography": "Alvin P. Phippenney was born on November 28, 1847, in Ohio. He married Estelle (Stela) Ames on March 2, 1867, in Nemaha, Nebraska. They had four children and had been in Pueblo for 2-3 years, having moved from Glenrock, Nebraska. He was a widower with 4 small children as his wife had died earlier in 1879, possibly during childbirth. Alvin was scheduled to remarry on the evening of the day he died. He was survived by his fianc and four children Herbert Calvin, 10, Acel Guy, 7, Grace Adell, 5, and Ida May, 4. His funeral was held on Tuesday, July 1, at 4:00 p.m. and was noted by the Chieftain to be \"one of the largest ever seen in the city, there being some 30 vehicles in the procession all well filled.\"",
        "Incident": "Officer Alvin Phippenney, 31, was shot and killed in John Schwer's, Arkansas Hall Saloon on Santa Fe Avenue in Pueblo about 12:30 p.m. on June 30, 1879. Officer Phippenney was attempting to disarm a 'ranchman' named John Baxter when the shooting occurred. Baxter and a man named James Moore were both armed and had been drinking with others. About noon the group had become loud, and Officer Phippenney responded to quiet the group down. A physical altercation ensued and Phippenney 'clinched' (grabbed and held) with Baxter, who was known to be dangerous when drinking. Baxter had stated that he would not give up his gun. Moore was also known to be carrying a gun. Witnesses stated that five or six shots were fired. The first shot was fired in the saloon then three or four were found in the street before they rolled back into the saloon where a final shot was heard. Officer Phippenney was shot and died about 15 minutes later. Before dying he stated that he had been shot by Baxter and another man. The fatal shot struck Phippenney in the back with the ball traveling thru his body and stopping just before breaking the skin of his chest. At the request of Pueblo Officer Bibly, the ball was removed from Phippenney's body by Dr. Cortwright. Witnesses stated that the ball was too small to have come from Baxter's gun, but that Moore's gun was smaller. Baxter received a scalp laceration and was also shot in the stomach during the fight.<br></br>A Coroner's jury listened to at least a dozen witnesses before finding that Alvin Phippenney came to his death from a pistol shot from the hands of John Baxter or James Moore. The Pueblo Chieftain newspaper stated that Baxter was mortally wounded, however he recovered enough to escape on July 8 from the Bartels building (part of the Lindell Hotel) where he was being held. Baxter just walked out the back door of the building which was only being guarded at the front door. The Chieftain expressed strong comments against the sheriff for his failure to properly guard a prisoner being held for the murder of a policeman. John Moore had left town on the day of the shooting, obtaining a horse and some money from a rancher after telling him he had shot a policeman in Pueblo and reportedly left for the Texas panhandle. No further information about either Baxter or Moore was found despite a $500.00 reward offered by the Pueblo City Council.",
        "Sources": "Pueblo Police Department - Chief Luis Velez<br></br>Pueblo Chieftain - July 1, 2, 8, & 9, 1879<br></br>Ancestry - Library Edition"
    },
    {
        "id": 16,
        "FirstName": "William",
        "MiddleInitial": "A.",
        "LastName": "Shellman",
        "Suffix": "",
        "Birthdate": "11/23/1860",
        "DateOfDeath": "08/12/1906",
        "Department": "Pueblo Police Department",
        "DatesOfService": "1905-1906",
        "PhotoFile": "Shellman_William.jpg",
        "Biography": "William A. Shellman was born November 23, 1860, and he married Matilda Nelson in 1883. Both were born in Sweden but had immigrated to the US when they were young. They resided in Pueblo for 22 years and Officer Shellman had been working for the Pueblo Police Dept. since May of 1905. He was also a member of the I.O.O.F. Lodge 17 and the W.O.W. Camp 49. Officer Shellman was noted as a popular, conscientious and reliable officer. He lived at 1408 Evans Ave., and the funeral was held there at 2:30 p.m. on the 13th. The service was conducted by the pastor of the Northern Avenue M. E. Church. The police, firemen, I.O.O.F. and W.O.W. accompanied the family to the burial at Roselawn Cemetery.<br></br>Officer Shellman was survived by his wife, Matilda, and seven children.",
        "Incident": "Pueblo Mounted Officer William Shellman, 45, died on August 12, 1906, at St. Mary's Hospital from the effects of being struck by lightning. Officer Shellman was patrolling his beat in the Bessemer district on Sunday, August 5, during an electrical storm when he was struck by lightning and knocked off his horse. He complained of feeling unwell all week and Saturday night called police HQ to advise them that he was on his way to the hospital, He died there several hours later, early Sunday morning.",
        "Sources": "Pueblo Police Department<br></br>The Pueblo Chieftain - August 13, 14, 1906<br></br>US Census - 1900, 1910, Pueblo"
    },
    {
        "id": 17,
        "FirstName": "Elwin",
        "MiddleInitial": "M.",
        "LastName": "Slater",
        "Suffix": "",
        "Birthdate": "04/1856",
        "DateOfDeath": "10/08/1903",
        "Department": "Pueblo Police Department",
        "DatesOfService": "Unknown",
        "PhotoFile": "Slater_Elwin.jpg",
        "Biography": "Elwin Merrill Slater was born in Illinois in April 1856. He married Zilpha May Eno in Tonica, Illinois, on February 27, 1881. He was survived by his wife and three children, LeeRoy, 21, Joseph, 17 and Ethel, 13.<br></br>A double funeral ceremony for Edwin Slater and Silas Martz (Marts) who were killed in the same incident was held on October 11 at the First Baptist Church at 9th and Court. Both were remembered for their dedication to duty and the love they showed to their families. Over 2,000 attended and it was noted that several hundred carriages were in the procession to Riverview Cemetery (not Roselawn Cemetery) where they were buried side by side.<br></br>Dr. Rice was so drunk that he didn't remember anything that occurred that evening. He apparently had a problem with alcohol for some time prior and had recently started adding cocaine and morphine to the mix. A trial was held in December and Rice's defense was 'temporary insanity'. A number of doctors testified to that, and Rice was found not guilty by a jury on December 31, 1903. Rice died from cancer in 1922 at the age of 63.",
        "Incident": "Officer Silas Martz (Marts), 43, was shot and killed on October 7, 1903, inside the Palace Drug store near 2nd and Main in Pueblo. Officer Marts was attempting to arrest Dr. Charles O. Rice, 44, who was drunk on alcohol and morphine and armed with a .45 caliber Colt revolver. About 8:00 p.m. Rice had become crazed. He threatened the employees and customers and chased them from the store. A crowd estimated at 1000 people eventually gathered and the police held them back not knowing what Rice would do. Finally, about 9:30 p.m. Officers Marts and Daly entered the building and attempted to talk to Rice in a friendly manner. Dr. Rice waited until Marts was about 8 away and then fired one shot which struck Marts in the neck. With Dalys help, Marts was able to stagger out of the store and across the street. He was attended to immediately, but he died in the ambulance on the way to the hospital from a severed jugular vein.<br></br>Officer Elwin Slater was outside, and the crowd was jeering the police officers. Slater determined that he would sneak in and crawl around to where Dr. Rice was. About 9:45 p.m. he entered the store with his hand on his holstered gun. As he moved to a crouched position a gunshot was heard, and Slater was shot in the right leg. He was helped out of the drug store and taken to the hospital. Investigation afterward found that Slater had partially drawn his gun and accidentally shot himself when he crouched down. The bullet left a hole on the inside of his holster and entered his thigh which caused internal hemorrhaging. He died the next day, October 8, at 5:20 p.m. believing that hed been shot by Dr. Rice, but that was not the case.<br></br>The drug store did not have a rear entrance and that hampered the efforts to capture Dr. Rice. Just before Officer Slater entered the store others were working on a different plan. Detective F. Rubichaud, Assistant Fire Chief Campbell and Firefighter Davenport had gained access to an adjoining business, went to the basement, removed a partition and found Dr. Rice passed out in the basement of the drug store. Rice was arrested and charged with murder. Dr. Rice had been the family physician for the Marts family for 12 years which may be why he thought he could talk Rice out of using the gun.",
         "Sources": "Pueblo Police Department<br></br>Pueblo Chieftain - Oct 8-20, 1903, and May 12, 2001<br></br>Deputy Chief Ronald A. Gravatt (retired) Pueblo PD. Research<br></br>Ancestry - Library Edition"
    },
    {
        "id": 18,
        "FirstName": "Elmer",
        "MiddleInitial": "A.",
        "LastName": "Trout",
        "Suffix": "",
        "Birthdate": "02/22/1899",
        "DateOfDeath": "09/23/1935",
        "Department": "Retired July 16, 1934 - Pueblo Police Department",
        "DatesOfService": "",
        "PhotoFile": "Trout_Elmer.jpg",
        "Biography": "Elmer Arthur Trout was born on February 27, 1899, in Canton, McPherson Co., Kansas. He married Wilma May Davis on July 1, 1927, in Pueblo. Elmer started working for the Colorado Steelworks on August 14, 1917, left to join the US Marine Corp on June 5, 1918, and returned to the Steelworks after his discharge from the military on March 27, 1919. He quit the Steelworks and joined the Pueblo Police Department on March 2, 1927. As a result of the injuries he received in the attack, he developed an epileptic condition and was forced to retire from the force on July 16, 1934, receiving a pension from the city. Elmer Trout was admitted to the city hospital on September 11 and died there on Monday, September 23, 1935, from diphtheria. Physicians reported that his injuries from five years earlies were responsible for the death. He was survived by his wife and four children, Elmer Arthur (Jr.) 7, Willa Mae, 5, Geraldine Ruth, 3, and Joyce Emily, 2. Services were held on September 26 at the Davis Mortuary with interment following at Roselawn Cemetery.",
        "Incident": "Pueblo Police Officer Elmer A. Trout, 36, died September 23, 1935, as a result of injuries received five years earlier when he was attacked and severely beaten outside Benfatti Pool Hall at 333 North Union Ave. in Pueblo.<br></br>On February 22, 1930, Officer Trout (then 30) attempted to disperse a mob of 15-20 young hoodlums when the group assaulted him, cut him on the head, neck and face with a knife, then knocked him down and kicked him numerous times knocking him unconscious. Officer Trout did manage to fire his gun one time and wound a suspect, Angelo Martino, 23, in the leg, before his gun jammed after the first shot. Investigating officers included Night Captain Reuben Pratt and Officers Dewey Roberts and John Hopkins. They found that Officer Trout had attempted to break up the group as they were causing a disturbance and shouting insults at people passing by. Sixteen people were arrested for the attack but twelve were released during the trial when witnesses were unable to positively identify them as being part of the gang that beat the officer. The four that were identified at the trial on March 6, 1930, were: Steve Buccambuso, 17, Sam Buccambuso, 21, their father, Gaetano (Tony) Buccambuso, 58, and Martino. Officer Trout, and others, testified at the trial. The four were convicted of rioting by a three-man jury in Justice of the Peace, William Walks court on March 6, 1930. Sam Buccambuso received a 6-month jail sentence while his brother Steve and Angelo Martino each received three-month sentences. Tony Buccambuso was fined $100.00 and costs.",
         "Sources": "Pueblo Police Department - Chief Luis Velez<br></br>Trout family history provided to Pueblo Police Department<br></br>Pueblo Chieftain - Mar 4, 1917: Sep 24-26, 1935; Feb 23-26, Mar 1,2,7, 1930<br></br>Pueblo Star Journal - Jul 7, 23, 1934; Sep 26, 1935<br></br>Ancestry - Library Edition"
    },
    {
        "id": 19,
        "FirstName": "Warren",
        "MiddleInitial": "W.",
        "LastName": "Watts",
        "Suffix": "",
        "Birthdate": "10/08/1958 ",
        "DateOfDeath": "06/16/2012",
        "Department": "Pueblo County Sheriffs Office",
        "DatesOfService": "1993 - 2012",
        "PhotoFile": "Watts_Warren.jpg",
        "Biography": "Warren Wayte Watts was born in Pueblo on October 8, 1958. He married his high school sweetheart, Lori in 1979. He received his peace officer certification on March 26, 1993, and joined the Pueblo County Sheriffs Department. He spent his career in patrol, investigations and also did a two-year assignment in the FBIs Joint Terrorism Task Force. He was an arson investigator and commander of the SWAT team. He received numerous commendations for his work and was named Uniform Officer of the Year in 2005. He also served as inspector of the Professional Standards Office (Internal Affairs).<br></br>He was survived by his wife, daughters Brittany and Nicole: brother Bill (Laura) of Colorado Springs; sisters, Roseanna (Bob) of Pueblo and Evelyn (Danny) Robinson of Wichita; parents-in-law Hank and Joy Bowling, and sister-in-law Kim (John) Butkovich; two nieces and six nephews. Services were held on June 21 at Praise Assembly in Pueblo. Interment was at Mountain View Cemetery.<br></br>The U. S. Department of Justice, Public Safety Officers Benefit (PSOB) reviewed this case and determined that Sergeant/Inspector Watts died as a direct result of a heart attack suffered not later than 24 hours after engaging in an on-duty situation involving non-routine stressful or strenuous physical activity.",
        "Incident": "Sergeant/Inspector Warren Watts, 53, collapsed at his home just after his morning run at 7:04 a.m. on June 16, 2012. His wife witnessed his fall and called 911. Pueblo Fire responded and he was transported to St. Mary-Corwin Medical Center and was pronounced dead at 7:41 a.m. from cardiac arrest. He had worked the day before and was preparing to go to work the day he collapsed. Although he had been scheduled to be off that day, his presence at work was requested by Undersheriff Justin Hall. Hall wanted him to meet with U.S. Secret Service agents regarding the upcoming visit of first lady Michelle Obama on June 20. Watts was the sheriffs office liaison for security issues when prominent dignitaries visited Pueblo.<br></br>The death certificate listed the cause of death as cardiac arrest due to coronary artery disease due to ASCVD (atherosclerotic cardiovascular disease). The pathologists report indicated medical evidence was present to suggest that Watts suffered a non-fatal cardia event within 24 hours of his fatal heart attack. Although he was off duty when the fatal heart attack occurred, Medical Examiner Dr. James Wilkerson determined that Watts had suffered three heart attacks based on scar tissue  one the morning of his death, on the previous day and one weeks earlier.<br></br>The day before, Watts, while wearing SWAT equipment, worked a special event for more than five hours where he demonstrated SWAT specialized training techniques to the public. He also responded to a disturbance call that afternoon. Another officer noted that Watts complained of stomach pain and appeared to be hot. Five weeks earlier, May 10, Watts was on the scene of a hostage situation where a man was holding his 93-year-old mother hostage. When an opportunity presented itself, Watts, wearing full tactical gear, grabbed the hostage and carried her about 100 yards away from the danger. He then returned to the house and used a stun grenade and assisted in arresting the suspect. Witness noted that Watts was sweating profusely and was out of breath after this incident. Dr. Wilkerson stated that both events fit exactly into the timeline of the scaring he had observed in the heart. It, in his opinion, confirmed two prior heart attacks before his fatal one on June 16. It was also found that Watts had complained of indigestion after both of the events and had been taking over-the-counter pills for heartburn.",
         "Sources": "Sheriff Kirk Taylor, Pueblo County Sheriffs Office<br></br>Investigative report, Undersheriff Justin Hall<br></br>Pueblo Chieftain: June 17, 18, 2012<br></br>The Pueblo West View: December 24, 2015<br></br>U.S. Department of Justice, PSOB approval letter, November 30, 2015<br></br>Ancestry - Library Edition"
    },
    {
        "id": 20,
        "FirstName": "Casper",
        "MiddleInitial": "",
        "LastName": "Zweifel",
        "Suffix": "",
        "Birthdate": "1847",
        "DateOfDeath": "07/25/1884",
        "Department": "Central Pueblo Marshals Office",
        "DatesOfService": "Less than a week in 1884",
        "PhotoFile": "Zweifel_Casper.jpg",
        "Biography": "Casper Zweifel was born in Switzerland in 1847. He had been in the United States for many years and had served in the Union Army in Missouri, fighting guerillas like the James Gang and other bands of rebels. He had lived in Denver and Leadville before moving to Pueblo four years earlier. He had just been appointed Marshal the first part of the week. He is survived by his wife. The funeral was held on Sunday, July 27th at the Marshals home, at the corner of Court and Second streets.<br></br>The Daily Chieftain had the following announcement in the paper on that date. \"Attention, Policeman. All policemen of Pueblo and South Pueblo are hereby notified to attend the funeral services of the late Casper Zweifel, Sunday afternoon at 2 oclock.  (Signed) JOHN GILLEN, Marshal of Pueblo. CHRIS HAHN, Marshal of South Pueblo.\"<br></br>Several public notices and preparations were published in the paper. This included the order of the funeral procession which read as follows: \"Marshals; Police; Band; Militia; Firemen; Concordia Maennerchor, Knights of Honor; hearse; family and relatives; city officers; friends\"<br></br>Marshal Zweifel was laid to rest in Pueblo.",
        "Incident": "Central Pueblo Marshal Casper Zweifel, 37, died after being stabbed by a young man he had arrested for passing counterfeit silver dollars at businesses along Union Avenue. Marshal Zweifel had been watching for such a person and captured him at Hendersons saloon, shortly after midnight on Friday, July 25, 1884. The Marshal was walking the subject up Union Avenue to the calaboose when the man pulled out a pocketknife and stabbed the Marshal twice in the groin, once in each leg, then took off. Marshal Zweifel ran after him and fired several shots before collapsing after about 75 yards. Townspeople, hearing the shots. Found the Marshal and carried him into the Bessemer Exchange Saloon where he died almost immediately. Dr. Taylor, the county coroner, examined the Marshal and determined the cause of death. It was found that the stab wound in the left groin had severed the femoral artery and Marshal Zweifel had bled to death very quickly. The other wound in the right groin just missed the femoral artery there. The knife with a 4-inch blade was recovered at the scene where the Marshal was attacked.<br></br>A coroners inquest was held on July 25th while Marshal Zweifels body remained in the Bessemer Exchange. They examined several witnesses and determined that Marshal Zweifel came to his death from a loss of blood after being stabbed in the left thigh and that said wound was inflicted by party or parties unknown, while deceased was performing his duty as Marshal of Central Pueblo, in attempting to arrest said unknown party for passing counterfeit money. The counterfeit silver dollars were made of pewter which made them lighter than the real ones. The pewter ones also did not have a ring to them.<br></br>The person that stabbed the Marshal was described as about 23-25 years old, 56  58 tall with a short mustache. He fled from town. The search began almost immediately but it was later in the morning when a reported sighting led Deputy Kelly and Mr. Henderson up Rock Canyon along the Santa Fe coal branch. They tracked and finally spotted the suspect and pursued him. When they had almost caught up, the suspect jumped into the Arkansas River with Kelly and Henderson jumping in after him. The chase continued on the south side of the river along the D&RG tracks before the suspect again took to the water, with his two pursuers following back to the north side of the river. The suspect then entered the river for a third time crossing back to the south side. Kelly and Henderson followed but Henderson struck something in the water and was injured, requiring Kelly to have to rescue him. By the time the men got across the river their suspect had escaped. Deputy Kelly and Mr. Henderson then returned to Pueblo to rest and get new clothing and money. Other suspects were picked up then released when it was determined they were not the one being looked for. Another suspect was picked up near Ojo at La Veta, but he got away by exiting the train at the steelworks and walked through town. No one was ever caught for the murder of Marshal Zweifel.",
         "Sources": ""
    }
]