[
    {
        "id": 1,
        "FirstName": "Frank",
        "MiddleInitial": "",
        "LastName": "Atencio",
        "Suffix": "",
        "Awards": "Purple Heart Medal, Good Conduct Medal, National Defense Medal, Presidential Unit Citation",
        "Birthdate": "07/26/1932",
        "Branch": "U.S. Marines",
        "DateService": "1949 - 1952",
        "WarsServed": "Korean War",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Atencio_Frank.jpg",
        "Biography": "Frank Atencio enlisted in the U.S. Marines in October 1949. He is a highly decorated and very well-respected Pueblo Marine Corps veteran. He is 92 years old and fought courageously in the Korean War. In 2018, Mr. Atencio was selected as the Honorary Parade Marshal for the Pueblo Veteran’s Day Parade. In 1950 he arrived in Korea and at Chosen Reservoir his unit was surrounded by an estimated 200.,000 Chinese and Korean soldiers. From his division he was one of 82 out of 220 Marines that survived as he fought courageously with them. Later, in 1951, he was part of a Spring Offensive to take back Wonju, Korea. His squad suffered 100% casualties (killed or wounded). He fought bravely on behalf of his fellow Marines and was flown out by helicopter the next morning due to his combat battle injuries. He suffered from PTSD, frost bite, burns, and 52 pieces of shrapnel are still lodged in his leg. In January of 1952, Atencio was chosen as “Marine of the Year” he also chosen to serve as an “Admiral’s Orderly” for his outstanding Marine Service. Atencio’s unit received the Navy Presidential Unit Citation, which is awarded to units of the U.S. Navy and Marine Corps for extraordinary heroism in action against an armed enemy. In October of 1951 Atencio and four other Korean War veterans were awarded the “Purple Heart” Medal.",
        "FormSubmitterName": "Gloria Gutiérrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 2,
        "FirstName": "Alfred (Al)",
        "MiddleInitial": "",
        "LastName": "Duran",
        "Suffix": "",
        "Awards": "WWII Victory Medal",
        "Birthdate": "12/11/28",
        "Branch": "U.S. Marine Corps",
        "DateService": "1945 - 1952",
        "WarsServed": "WWII Peacetime, Korean War",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Duran_Alfred.jpg",
        "Biography": "Al worked at the Pueblo Army depot from January 1952 until his retirement in June 1988. Al’s desire to see overseas duty was still with his; he volunteered to go as a “Civilian” ammunition inventory specialist to Vietnam to assist the Army.  He was awarded a “Certificate of Achievement” after his return to the United States. Al has been married to Angie for over 66 years, they have seven children, ten grandchildren, and six great grandchildren.  Al joined the Pueblo Veteran’s Ritual Team in 1980, the Knights of Columbus in 1960 and the Nocturnal Adoration Society in 1959. He participates in many organizations American GI Forum, Meals On Wheels, Community Soup Kitchen, Parish Council and he is a Eucharistic Minister.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 3,
        "FirstName": "Albertina (Tina)",
        "MiddleInitial": "",
        "LastName": "Espinoza",
        "Suffix": "",
        "Awards": "Good Conduct Medal, National Defense Service Medal, recognition as WAC of the month, The Women in Military Service for America Foundation Inc. Proudly added her name to the Memorial’s Historic Roll of Honor on Feb. 4, 1999.",
        "Birthdate": "5/1/1941",
        "Branch": "U.S. Army",
        "DateService": "1961 - 1964",
        "WarsServed": "Peacetime",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Espinoza_Albertina_T.jpg",
        "Biography": "Tina is the ninth child of ten siblings, born in “El Jose Antonia Ranch” in New Mexico. Her father was a WWI Veteran, who suffered with PTSD. She was a caregiver of her disabled brother She had two older brothers who were active military, the younger brother Alex was killed in action in the Korean conflict in 1952. Tina completed basic training at Ft. McClelland, Alabama. Tours of duty included Ft. Houston in San Antonio , Texas, and deployments to U.S./European military hospitals in Heidelburg, Germany with her last assignment ending at Ft. D’Orleans, France, where’s he was commissioned as a military nurse.  As a WAC she was dedicated to serving her to time nursing military personnel and families.<br></br>After her military service Tina married and lived for a short time in New York. She had two children and eventually moved back to New Mexico to be close to her sisters and mother. She enrolled in nursing school and completed her studies as a LPN.<br></br>Tina served as a nurse at Parkview Hospital for 20 years. She continued to heed her calling as a caregiver, working at several nursing homes caring for the elderly. She also cared for sick family and friends in their homes and at hospice as their personal nurse. Tina continued serving her community in many others ways besides hospice care. She is committed to her religious beliefs of helping others in need and participates in several prayers groups; she serves as a Eucharistic minister for the home bound at Holy Family Parish. She continues to develop professionally by enrolling in continuing education classes to enhance her LPN certification.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 4,
        "FirstName": "Judy",
        "MiddleInitial": "",
        "LastName": "Garcia-Carder",
        "Suffix": "",
        "Awards": "Naval Reserve Meritorious Service Medal (2), Armed Forces Reserve Medal (2), Good Conduct Medal Award (5), National Defense Service Medal, Navy Recruiting Service Ribbon (4) Navy and Marine Corps Achievement Medal.",
        "Birthdate": "3/1/1942",
        "Branch": "U.S. Navy Reserves",
        "DateService": "1986 - 2002",
        "WarsServed": "Peacetime",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Carder_Judy_Garcia.jpg",
        "Biography": "In 1960, as a member of South High School’s first graduating class, enlisted in to the U.S. Navy and Naval Reserves serving for 31 years. She headed to bootcamp no July 12, 1960, and caught a flight to USNTC Bainbridge, MD to start her naval carder. At the are of 18 July was as signed to Admiral Hyman Rickover staff whose offices were located on the Washington Mall between the Washington Monument and the Lincoln Memorial. Petty Officer Garcia Carder was present at the MLK I Have a Dream speech. Judy married a sailor and they lived in Morocco, West Africa. In 1970, she returned to Pueblo and enlisted in the Naval Reserves, graduated from SCSC in 1974 with a BSBA degree and worked for 12 years in Student Services at the College. In 1975, Judy was appointed by Governor Lamm to serve on the Colorado Women’s Commission. In 1985 Judy was selected to serve as the Grand Marshall for the Colorado Fiesta Day Parade. In 2002 Judy volunteered and created the Disabled Vets Transport Program, driving disabled veterans to the VA Clinic in Denver for medical appointments.  Judy worked with and organized veterans in Trinidad, Limón, and Walsenburg to take veterans to VA appointments by hiring 13 drivers and she found grant funds to purchase three vehicles to take veterans to the Denver VA. She set up rural clients in Alamosa to be transported to Walsenburg, then to Pueblo and then to Denver VA appointments.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 5,
        "FirstName": "Alfred",
        "MiddleInitial": "L.",
        "LastName": "Lucero",
        "Suffix": "",
        "Awards": "Vietnam Service Medal w/3 Bronze Service Stars, National Defense Service Medal, Combat Infantry Medal, Republic of Vietnam Campaign Medal, Army Commendation Medal, Purple Heart, Sharpshooter (Rifle)",
        "Birthdate": "1/4/49",
        "Branch": "U.S. Army",
        "DateService": "",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Lucero_Alfred.jpg",
        "Biography": " Sergeant Alfred L. Lucero served in the U.S. Army with the 101st Air borne “Screaming Eagles” during the Vietnam War. After his tour of duty Lucero earned his B.A. in Elementary Education from SCSC, now known as CSU-Pueblo. He earned a master’s degree in Guidance and Counseling from UNC in Greeley. He moved back to his hometown of Pueblo in 1990. He became active in counseling throughout the city.  He held wrestling clinics for kids, as well as supporting programs such as Operation School Bell and BOCES Migrant Education. In2011 due to complications from Agent Orange he was forces to retired. Mr. Alfred has been a role model for many children in Pueblo. He has represented the Latino Veterans very well.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 6,
        "FirstName": "Jose’ Arturo",
        "MiddleInitial": "",
        "LastName": "Ramirez",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "7/30/1973",
        "Branch": "U.S. Marines, U.S. Army",
        "DateService": "1991 - 2023",
        "WarsServed": "Iraq, Afghanistan Global War in Terrorism",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Ramirez_Jack.jpg",
        "Biography": "Jose’ Ramírez was born and raised in Pueblo, CO. He attended Pueblo Central High School and graduated in 1991. Upon graduation he enlisted in the U.S. Marine Corps as a Mortar Man from July 1991 to July 1995. Upon completion of his enlistment he took positions with the Rocky Ford Police Department as a Patrol Officer from August 1995 to Nov 1996 and Otero County Sheriff’s Department as a Road Deputy from Nov 1996; to Nov 1999. In April 2002 he enlisted in the U.S. Army as a Watercraft Operator. In March 2005 Jose’ attended the Army’s Special Forces Assessment and Selection and was accepted into the Army’s Special Forces Qualification course as a special Force Medical Sergeant, graduating from the Qualification course and earning his Green Beret in May 2007. He retired in March 2023 with 25 years of Military service and is currently serving as Project Manager for Next Chapter a Veteran Suicide Prevention Pilot Program for UC Health. Jose’ has three sons (Joseph, Israel, and Alexander) and a granddaughter (Stella). His mother, Maria “Cuca” Ramírez has owned a small restaurant in Pueblo since 1991.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 7,
        "FirstName": "R. Jack",
        "MiddleInitial": "",
        "LastName": "Santos",
        "Suffix": "",
        "Awards": "National Defense Medal, Vietnam Service Medal, Vietnam Campaign Medal, 4 Overseas Service Bars, Bronze Star (1st Oak Leaf Cluster w/V Device), Combat Medal Badge, Army Commendation Medal (2nd Oak Leaf Cluster) Purple Heart (OLC)",
        "Birthdate": "4/8/1945",
        "Branch": "U.S. Army",
        "DateService": "1966 - 1971",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Santos_Jack.jpg",
        "Biography": "Staff Sergeant R Jack Santos served with the 101st Airborne and 173rd Airborne during the Vietnam War.  He served two tours 1966-67 and 1968-71 as a combat medic. After his return from Vietnam, he continued to serve his community in the emergency medical unit at Parkview Hospital. He also served as a State Patrolman for nine years and 16 years for the Fort Lupton Police Department. Mr. Santos is active in Veteran Service Organizations in Pueblo and continues to serve his community when the opportunity arises.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 8,
        "FirstName": "Linda",
        "MiddleInitial": "R.",
        "LastName": "Urrutia-Varhall",
        "Suffix": "",
        "Awards": "Distinguished Service Medal (Air Force) with one Oak Leaf Cluster; Defense Superior Service Medal with 3 Oak Leaf Clusters; Legion of Mary with 1 Oak Leaf Cluster; Defense Meritorious Service Medal with 2 Oak Leaf Clusters, Joint Service Commendation Medal with 1 Oak Cluster; Joint Service Achievement Medal with 1 Oak Leaf Cluster ; Joint Meritorious Unit Award with 5 Oak Leaf  Clusters; Meritorious Unit Award; AF Outstanding Unit Award with 8 Oak Leaf Clusters; AF Organizational Excellence Award with 3 Oak Leaf Clusters; AF Recognition Ribbon; National Defense Service Medal with 1 Service Star; Armed Forces Expeditionary Medal; Global War on Terrorism Expeditionary Medal; Global War on Terrorism Service Medal; Korean Defense Service Medal; AF Overseas Ribbon Short with 1 Oak Leaf Cluster; AF Overseas Ribbon Long; Air Force Expeditionary Service Medal.",
        "Birthdate": "5/23/61",
        "Branch": "U.S. Air Force",
        "DateService": "1984 - 2025 (current)",
        "WarsServed": "Global War on Terrorism, Peacetime",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Urrutia-Varhall_Linda.jpg",
        "Biography": "Major General Urrutia-Varhall was born in Pueblo, Colorado and raised in the Bessemer area, and is an alum of Pueblo Central High School. She was commissioned in 1984 as a graduate from the U. S. Air Force Academy. Following her initial assignment at Offutt Air Base Nebraska, she was selected to participate in the Professional Military Graduate Intelligence Program in Washington, DC. After completion she was the first Air Force representative to the National Military Intelligence Center. Major General Urrutia-Varhall service at the Pentagon, included executive support duty to three Secretaries of Defense and as an international politico-military affairs officer on the Somalia Task Force. As of 2024 she was serving as Director of Operations, National Geospatial-Intelligence Agency, Springfield, Virginia.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 9,
        "FirstName": "Arthur",
        "MiddleInitial": "James",
        "LastName": "Velasquez",
        "Suffix": "Sr.",
        "Awards": "Bronze Star Medal, National Defense Service Medal, Vietnam Service Medal with 1 Bronze star, Republic of Vietnam Campaign Ribbon w/device (1960), Expert Badge with Auto Rifle Bar, Sharpshooter badge with Rifle Bar",
        "Birthdate": "8/2/1947",
        "Branch": "U.S. Army",
        "DateService": "1962 - 1971",
        "WarsServed": "Vietnam, Reserves stateside through July 1975",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Velasquez_Arthur.jpg",
        "Biography": "Art served in the government for 36 years when he returned home from the service; worked for the government printing office for nine years; worked at the Pueblo Army Depot for 21 years and the U.S. Post Office for 6 years. He was diagnosed as 100 percent disabled by the the VA.<br><br>Art assisted veterans with their paperwork to apply for service-connected disabilities; he helped the elderly with handman services as needs such as plumbing issues, electrical, or yard work.<br><br>He has been married for 53 years; he contracted the coronavirus and was hospitalized for 12 days - and was finally able to go home. He gives thanks to his wife and all the nurses and doctors who healed him. He also gives thanks for prayers from family and friends. His two children finished college - his daughter earned her doctoral degree in education and has course children and his son is a pharmacist at the VA Clinic in Denver.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 10,
        "FirstName": "Claude (Butch)",
        "MiddleInitial": "",
        "LastName": "Chavez",
        "Suffix": "",
        "Awards": "Vietnam Service Medal; National Defense Service Medal; RVCM; Air Force Medal 900-3; Air Force Good Conduct Medal",
        "Birthdate": "5/8/1946",
        "Branch": "U.S. Air Force ",
        "DateService": "1964 - 1968",
        "WarsServed": "Vietnam",
        "DateDiceased": "2/25/2022",
        "YearInducted": "2023",
        "PhotoFile": "Chavez_Butch.jpg",
        "Biography": "Claude “Butch” Chávez has made a measurable impact over the past several years as a passionate advocate for all veterans in Pueblo. His volunteer activities are varied as are his skills, to include: working with the American Legion Riders; writing letters to the Pueblo Legislature; writing numerous articles for the Pueblo Chieftain regarding veterans issues, and raising awareness especially for the Prisoners of War and Missing in Action (POW-MIA). He has also frequently been asked to speak at presentations or events in the Pueblo community. His contribution to others is even more impressive when you consider the many personal health challenges that he himself has endured over the years due to exposure to Agent Orange. His niece. Rhonda Gasperriti states that “his service to others has inspired me to become more involved in the community, reaching out to those who are not as privileged and share our talents with those around us in order to make a positive change in our community and our world.  I am merely one of the many lives that he has influenced throughout his daily life.”  Claude took the initiative to do something to help his community. He diligently worked to institute the POW/ MIA effort. Bestowing upon Claude Chavez this prestigious award is a great recognition of all the sacrifices he made and continued to make throughout his life.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    }
]