[
    {
        "id": 1,
        "FirstName": "Frank",
        "MiddleInitial": "",
        "LastName": "Atencio",
        "Suffix": "",
        "Awards": "Purple Heart Medal, Good Conduct Medal, National Defense Medal, Presidential Unit Citation",
        "Birthdate": "07/26/1932",
        "Branch": "U.S. Marines",
        "DateService": "1949 - 1952",
        "WarsServed": "Korean War",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Atencio_Frank.jpg",
        "Biography": "Frank Atencio enlisted in the U.S. Marines in October 1949. He is a highly decorated and very well-respected Pueblo Marine Corps veteran. He is 92 years old and fought courageously in the Korean War. In 2018, Mr. Atencio was selected as the Honorary Parade Marshal for the Pueblo Veteran’s Day Parade. In 1950 he arrived in Korea and at Chosen Reservoir his unit was surrounded by an estimated 200.,000 Chinese and Korean soldiers. From his division he was one of 82 out of 220 Marines that survived as he fought courageously with them. Later, in 1951, he was part of a Spring Offensive to take back Wonju, Korea. His squad suffered 100% casualties (killed or wounded). He fought bravely on behalf of his fellow Marines and was flown out by helicopter the next morning due to his combat battle injuries. He suffered from PTSD, frost bite, burns, and 52 pieces of shrapnel are still lodged in his leg. In January of 1952, Atencio was chosen as “Marine of the Year” he also chosen to serve as an “Admiral’s Orderly” for his outstanding Marine Service. Atencio’s unit received the Navy Presidential Unit Citation, which is awarded to units of the U.S. Navy and Marine Corps for extraordinary heroism in action against an armed enemy. In October of 1951 Atencio and four other Korean War veterans were awarded the “Purple Heart” Medal.",
        "FormSubmitterName": "Gloria Gutiérrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 2,
        "FirstName": "Alfred (Al)",
        "MiddleInitial": "",
        "LastName": "Duran",
        "Suffix": "",
        "Awards": "WWII Victory Medal",
        "Birthdate": "12/11/28",
        "Branch": "U.S. Marine Corps",
        "DateService": "1945 - 1952",
        "WarsServed": "WWII Peacetime, Korean War",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Duran_Alfred.jpg",
        "Biography": "Al worked at the Pueblo Army depot from January 1952 until his retirement in June 1988. Al’s desire to see overseas duty was still with his; he volunteered to go as a “Civilian” ammunition inventory specialist to Vietnam to assist the Army.  He was awarded a “Certificate of Achievement” after his return to the United States. Al has been married to Angie for over 66 years, they have seven children, ten grandchildren, and six great grandchildren.  Al joined the Pueblo Veteran’s Ritual Team in 1980, the Knights of Columbus in 1960 and the Nocturnal Adoration Society in 1959. He participates in many organizations American GI Forum, Meals On Wheels, Community Soup Kitchen, Parish Council and he is a Eucharistic Minister.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 3,
        "FirstName": "Albertina (Tina)",
        "MiddleInitial": "",
        "LastName": "Espinoza",
        "Suffix": "",
        "Awards": "Good Conduct Medal, National Defense Service Medal, recognition as WAC of the month, The Women in Military Service for America Foundation Inc. Proudly added her name to the Memorial’s Historic Roll of Honor on Feb. 4, 1999.",
        "Birthdate": "5/1/1941",
        "Branch": "U.S. Army",
        "DateService": "1961 - 1964",
        "WarsServed": "Peacetime",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Espinoza_Albertina_T.jpg",
        "Biography": "Tina is the ninth child of ten siblings, born in “El Jose Antonia Ranch” in New Mexico. Her father was a WWI Veteran, who suffered with PTSD. She was a caregiver of her disabled brother She had two older brothers who were active military, the younger brother Alex was killed in action in the Korean conflict in 1952. Tina completed basic training at Ft. McClelland, Alabama. Tours of duty included Ft. Houston in San Antonio , Texas, and deployments to U.S./European military hospitals in Heidelburg, Germany with her last assignment ending at Ft. D’Orleans, France, where’s he was commissioned as a military nurse.  As a WAC she was dedicated to serving her to time nursing military personnel and families.<br></br>After her military service Tina married and lived for a short time in New York. She had two children and eventually moved back to New Mexico to be close to her sisters and mother. She enrolled in nursing school and completed her studies as a LPN.<br></br>Tina served as a nurse at Parkview Hospital for 20 years. She continued to heed her calling as a caregiver, working at several nursing homes caring for the elderly. She also cared for sick family and friends in their homes and at hospice as their personal nurse. Tina continued serving her community in many others ways besides hospice care. She is committed to her religious beliefs of helping others in need and participates in several prayers groups; she serves as a Eucharistic minister for the home bound at Holy Family Parish. She continues to develop professionally by enrolling in continuing education classes to enhance her LPN certification.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 4,
        "FirstName": "Judy",
        "MiddleInitial": "",
        "LastName": "Garcia-Carder",
        "Suffix": "",
        "Awards": "Naval Reserve Meritorious Service Medal (2), Armed Forces Reserve Medal (2), Good Conduct Medal Award (5), National Defense Service Medal, Navy Recruiting Service Ribbon (4) Navy and Marine Corps Achievement Medal.",
        "Birthdate": "3/1/1942",
        "Branch": "U.S. Navy Reserves",
        "DateService": "1986 - 2002",
        "WarsServed": "Peacetime",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Carder_Judy_Garcia.jpg",
        "Biography": "In 1960, as a member of South High School’s first graduating class, enlisted in to the U.S. Navy and Naval Reserves serving for 31 years. She headed to bootcamp no July 12, 1960, and caught a flight to USNTC Bainbridge, MD to start her naval carder. At the are of 18 July was as signed to Admiral Hyman Rickover staff whose offices were located on the Washington Mall between the Washington Monument and the Lincoln Memorial. Petty Officer Garcia Carder was present at the MLK I Have a Dream speech. Judy married a sailor and they lived in Morocco, West Africa. In 1970, she returned to Pueblo and enlisted in the Naval Reserves, graduated from SCSC in 1974 with a BSBA degree and worked for 12 years in Student Services at the College. In 1975, Judy was appointed by Governor Lamm to serve on the Colorado Women’s Commission. In 1985 Judy was selected to serve as the Grand Marshall for the Colorado Fiesta Day Parade. In 2002 Judy volunteered and created the Disabled Vets Transport Program, driving disabled veterans to the VA Clinic in Denver for medical appointments.  Judy worked with and organized veterans in Trinidad, Limón, and Walsenburg to take veterans to VA appointments by hiring 13 drivers and she found grant funds to purchase three vehicles to take veterans to the Denver VA. She set up rural clients in Alamosa to be transported to Walsenburg, then to Pueblo and then to Denver VA appointments.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 5,
        "FirstName": "Alfred",
        "MiddleInitial": "L.",
        "LastName": "Lucero",
        "Suffix": "",
        "Awards": "Vietnam Service Medal w/3 Bronze Service Stars, National Defense Service Medal, Combat Infantry Medal, Republic of Vietnam Campaign Medal, Army Commendation Medal, Purple Heart, Sharpshooter (Rifle)",
        "Birthdate": "1/4/49",
        "Branch": "U.S. Army",
        "DateService": "",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Lucero_Alfred.jpg",
        "Biography": " Sergeant Alfred L. Lucero served in the U.S. Army with the 101st Air borne “Screaming Eagles” during the Vietnam War. After his tour of duty Lucero earned his B.A. in Elementary Education from SCSC, now known as CSU-Pueblo. He earned a master’s degree in Guidance and Counseling from UNC in Greeley. He moved back to his hometown of Pueblo in 1990. He became active in counseling throughout the city.  He held wrestling clinics for kids, as well as supporting programs such as Operation School Bell and BOCES Migrant Education. In2011 due to complications from Agent Orange he was forces to retired. Mr. Alfred has been a role model for many children in Pueblo. He has represented the Latino Veterans very well.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 6,
        "FirstName": "Jose’ Arturo",
        "MiddleInitial": "",
        "LastName": "Ramirez",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "7/30/1973",
        "Branch": "U.S. Marines, U.S. Army",
        "DateService": "1991 - 2023",
        "WarsServed": "Iraq, Afghanistan Global War in Terrorism",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Ramirez_Jack.jpg",
        "Biography": "Jose’ Ramírez was born and raised in Pueblo, CO. He attended Pueblo Central High School and graduated in 1991. Upon graduation he enlisted in the U.S. Marine Corps as a Mortar Man from July 1991 to July 1995. Upon completion of his enlistment he took positions with the Rocky Ford Police Department as a Patrol Officer from August 1995 to Nov 1996 and Otero County Sheriff’s Department as a Road Deputy from Nov 1996; to Nov 1999. In April 2002 he enlisted in the U.S. Army as a Watercraft Operator. In March 2005 Jose’ attended the Army’s Special Forces Assessment and Selection and was accepted into the Army’s Special Forces Qualification course as a special Force Medical Sergeant, graduating from the Qualification course and earning his Green Beret in May 2007. He retired in March 2023 with 25 years of Military service and is currently serving as Project Manager for Next Chapter a Veteran Suicide Prevention Pilot Program for UC Health. Jose’ has three sons (Joseph, Israel, and Alexander) and a granddaughter (Stella). His mother, Maria “Cuca” Ramírez has owned a small restaurant in Pueblo since 1991.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 7,
        "FirstName": "R. Jack",
        "MiddleInitial": "",
        "LastName": "Santos",
        "Suffix": "",
        "Awards": "National Defense Medal, Vietnam Service Medal, Vietnam Campaign Medal, 4 Overseas Service Bars, Bronze Star (1st Oak Leaf Cluster w/V Device), Combat Medal Badge, Army Commendation Medal (2nd Oak Leaf Cluster) Purple Heart (OLC)",
        "Birthdate": "4/8/1945",
        "Branch": "U.S. Army",
        "DateService": "1966 - 1971",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Santos_Jack.jpg",
        "Biography": "Staff Sergeant R Jack Santos served with the 101st Airborne and 173rd Airborne during the Vietnam War.  He served two tours 1966-67 and 1968-71 as a combat medic. After his return from Vietnam, he continued to serve his community in the emergency medical unit at Parkview Hospital. He also served as a State Patrolman for nine years and 16 years for the Fort Lupton Police Department. Mr. Santos is active in Veteran Service Organizations in Pueblo and continues to serve his community when the opportunity arises.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 8,
        "FirstName": "Linda",
        "MiddleInitial": "R.",
        "LastName": "Urrutia-Varhall",
        "Suffix": "",
        "Awards": "Distinguished Service Medal (Air Force) with one Oak Leaf Cluster; Defense Superior Service Medal with 3 Oak Leaf Clusters; Legion of Mary with 1 Oak Leaf Cluster; Defense Meritorious Service Medal with 2 Oak Leaf Clusters, Joint Service Commendation Medal with 1 Oak Cluster; Joint Service Achievement Medal with 1 Oak Leaf Cluster ; Joint Meritorious Unit Award with 5 Oak Leaf Clusters; Meritorious Unit Award; AF Outstanding Unit Award with 8 Oak Leaf Clusters; AF Organizational Excellence Award with 3 Oak Leaf Clusters; AF Recognition Ribbon; National Defense Service Medal with 1 Service Star; Armed Forces Expeditionary Medal; Global War on Terrorism Expeditionary Medal; Global War on Terrorism Service Medal; Korean Defense Service Medal; AF Overseas Ribbon Short with 1 Oak Leaf Cluster; AF Overseas Ribbon Long; Air Force Expeditionary Service Medal",
        "Birthdate": "5/23/61",
        "Branch": "U.S. Air Force",
        "DateService": "1984 - 2025 (current)",
        "WarsServed": "Global War on Terrorism",
        "DateDiceased": "",
        "YearInducted": "2024",
        "PhotoFile": "Urrutia-Varhall_Linda.jpg",
        "Biography": "Major General Urrutia-Varhall was born in Pueblo, Colorado and raised in the Bessemer area, and is an Alum of Pueblo Central High School. She was commissioned in 1984 as. Graduate from the U. s. Air Force Academy. Following her initial assignment at Offutt Air Base Nebraska, she was selected to participate in the Professional Military Graduate Intelligence Program in Washington, DC After completion she was the first Air Force representative to the National Military Intelligence Center. Major General Urrutia-Varhall service at the Pentagon, included executive support duty to three Secretaries of Defense and as an international politico-military affairs officer on the Somalia Task Force. Her last position was Director of Operations, National Geospatial-Intelligence Agency, Springfield, Virginia.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 9,
        "FirstName": "Arthur",
        "MiddleInitial": "James",
        "LastName": "Velasquez",
        "Suffix": "Sr.",
        "Awards": "Bronze Star Medal, National Defense Service Medal, Vietnam Service Medal with 1 Bronze star, Republic of Vietnam Campaign Ribbon w/device (1960), Expert Badge with Auto Rifle Bar, Sharpshooter badge with Rifle Bar",
        "Birthdate": "8/2/1947",
        "Branch": "U.S. Army",
        "DateService": "1962 - 1971",
        "WarsServed": "Vietnam, Reserves stateside through July 1975",
        "DateDiceased": "",
        "YearInducted": "2023",
        "PhotoFile": "Velasquez_Arthur.jpg",
        "Biography": "Art served in the government for 36 years when he returned home from the service; worked for the government printing office for nine years; worked at the Pueblo Army Depot for 21 years and the U.S. Post Office for 6 years. He was diagnosed as 100 percent disabled by the the VA.<br></br>Art assisted veterans with their paperwork to apply for service-connected disabilities; he helped the elderly with handman services as needs such as plumbing issues, electrical, or yard work.<br></br>He has been married for 53 years; he contracted the coronavirus and was hospitalized for 12 days - and was finally able to go home. He gives thanks to his wife and all the nurses and doctors who healed him. He also gives thanks for prayers from family and friends. His two children finished college - his daughter earned her doctoral degree in education and has course children and his son is a pharmacist at the VA Clinic in Denver.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 10,
        "FirstName": "Claude (Butch)",
        "MiddleInitial": "",
        "LastName": "Chavez",
        "Suffix": "",
        "Awards": "Vietnam Service Medal; National Defense Service Medal; RVCM; Air Force Medal 900-3; Air Force Good Conduct Medal",
        "Birthdate": "5/8/1946",
        "Branch": "U.S. Air Force ",
        "DateService": "1964 - 1968",
        "WarsServed": "Vietnam",
        "DateDiceased": "2/25/2022",
        "YearInducted": "2023",
        "PhotoFile": "Chavez_Butch.jpg",
        "Biography": "Claude “Butch” Chávez has made a measurable impact over the past several years as a passionate advocate for all veterans in Pueblo. His volunteer activities are varied as are his skills, to include: working with the American Legion Riders; writing letters to the Pueblo Legislature; writing numerous articles for the Pueblo Chieftain regarding veterans issues, and raising awareness especially for the Prisoners of War and Missing in Action (POW-MIA). He has also frequently been asked to speak at presentations or events in the Pueblo community. His contribution to others is even more impressive when you consider the many personal health challenges that he himself has endured over the years due to exposure to Agent Orange. His niece Rhonda Gasperriti states that “his service to others has inspired me to become more involved in the community, reaching out to those who are not as privileged and share our talents with those around us in order to make a positive change in our community and our world.  I am merely one of the many lives that he has influenced throughout his daily life.”  Claude took the initiative to do something to help his community. He diligently worked to institute the POW/ MIA effort. Bestowing upon Claude Chavez this prestigious award is a great recognition of all the sacrifices he made and continued to make throughout his life.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 11,
        "FirstName": "Jose",
        "MiddleInitial": "",
        "LastName": "Alanis",
        "Suffix": "",
        "Awards": "Iraq campaign medal with 3 campaign stars, Bronze Star Medal, ARMY Commendation Medal (3 Awards), Army Achievement Medal (2 Awards), Valorous Unit Award, Meritorious unit citation, ARMY Good Conduct Medal (4 Awards), Global War on Terrorism Expeditionary Medal, Global War on Terrorism Service Medal, Overseas Service Ribbon (3 Awards), Combat Infantryman Badge",
        "Birthdate": "08/15/1981",
        "Branch": "U.S. Army",
        "DateService": "2001 - 2011",
        "WarsServed": "OIF",
        "DateDiceased": "",
        "YearInducted": "2015",
        "PhotoFile": "",
        "Biography": "Jose Alanis is currently a veteran student at CSU-Pueblo where he is majoring in Spanish. Jose was raised by a single father in Woodstock, Illinois. It was in Woodstock that he understood that his life needed to change in order to give his family a better chance in life, He enlisted in the US Army in July of 2001 and was planning on making the military a career. While in the Army Jose rose through the ranks Serving with the 4th Infantry Division 3rd brigade. Jose's ARMY life took him to Colorado as he was based at Fort Carson, Jose's only duty station. Jose although was given orders to change duty stations which would have taken him to the beaches of Hawaii. His plans changed as he was deployed to Iraq during the initial invasion into Iraq. Serving with the 4th infantry division. The 4th infantry division served a crucial role during combat operations in Iraq; which eventually led to the capture of Sadaam Hussein, Jose was deployed two more times during his military career. His second tour of duty was served in the town of Baqubah Iraq. His unit provided vital resources to the community and provided security operations to the surrounding communities. During one of the deadliest eras of the war. Dealing with sectarian violence between the Sunni and Shiite tribes. But also having to deal with steady increases Of IED’s improvised explosive devices<br></br>Jose's final tour took Him to the Battle ridden city of Sadre City where the 3rd brigade, 4th infantry division was involved in some of the most intense fighting since the beginning of the war. The brigade was responsible for pushing back the Shiite militia into the city. Thus not allowing the militiamen to have the capability of firing rockets and mortars into what was known as the international green zone. Sadre City can be seen in the latest Hollywood Box office Hit American Sniper. During his time in deployment Jose and his brothers were able to create a bond that cannot be broken.<br></br>Although Jose wanted to continue with his plan and intended career his plans changed in his final deployment where he was injured and placed the temporary retired list. In August of 2014 Jose was permanently retired from the US Army. Jose understands the importance of giving back to his community and his fellow veterans. It was with this in mind that he joined LULAC and the board of the American Military Family. Jose was recently profiled for his military service by LULAC and it is that article I include in this, nomination. He deserves this honor of becoming a Latino Veterans Profile in the Courage Awards Ceremony because he is a true American Hero, Not only did he take on the role of protecting his soldiers and this country during his time on active duty and his three deployments. He has also taken that on as a retired veteran and is working to truly make a difference in veteran’s lives during and after the service. He has made it his mission to ensure that veterans are receiving the services they need to truly reintegrate into civilian life after the military, but also working to ensure their families are taken care of.<br></br>Jose deserves this honor because as a part of the Infantry division he understood that “No Mission Too Difficult, No Sacrifice Too Great, Duty First” and continues to live that motto today. The ARMY changed Jose’s life and he continues to give back to those who served.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-334-0988",
        "DonorName": ""
    },
    {
        "id": 12,
        "FirstName": "Elena",
        "MiddleInitial": "M.",
        "LastName": "Allen",
        "Suffix": "",
        "Awards": "Joint Service Achievement Medal, Good Conduct Medal, National Defense Medal, Non-Commissioned Officer's Professional Development Ribbon, Army Services Ribbon, Overseas Service Ribbon, CIA Certificate of Appreciation",
        "Birthdate": "12/23/1980",
        "Branch": "U.S. Army",
        "DateService": "1999 - 2002",
        "WarsServed": "",
        "DateDiceased": "",
        "YearInducted": "2021",
        "PhotoFile": "",
        "Biography": "Elena M. Allen, U.S Army Imagery Specialist - Nominated by Jeremiah Blaha.<br></br>Ms. Allen served four and a half years in the U.S. Army. Ms. Allen learned valuable skills in the military as an Imagery Specialist and she was an asset to her country. Ms. Allen received the following medals and citation ribbons, Joint Service Achievement Medal, Good Conduct Medal, National Defense Medal, Non-Commissioned Officer's Professional Development Ribbon, Army Services Ribbon Overseas Service Ribbon, CIA Certificate of Appreciation. Ms. Allen understands a veteran's service to their country doesn't end with discharge from the military. After being honorably discharged from the Army, Ms. Allen enrolled in the CSU-Pueblo Teacher Education Program with an emphasis in mathematics. With a strong academic background, Ms. Allen maintained an excellent grade point average and was inducted as a member of Phi Alpha Theta. Devoted to her students, Ms. Allen has received recognition and awards for her work in the community. Participating in the Unity of Pillars City Wide Safety Summit, Elena continually devotes her time and cenergy to the betterment of children's lives in the greater Pueblo community. Prior to its closing Ms. Allen served as a volunteer for the adult suicide line here in Pueblo. Currently, Ms. Allen is working as a mathematics instructor at Pueblo East High School. Ms. Allen remains dedicated to her students. She has found a way to continually serve her country and her community.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-302-5447",
        "DonorName": ""
    },
    {
        "id": 13,
        "FirstName": "Larry",
        "MiddleInitial": "D.",
        "LastName": "Alvarado",
        "Suffix": "",
        "Awards": "National Defense Service Medal, Good Conduct Medal, Army Commendation Medal, Vietnam Campaign Medal, Vietnam Service Medal, South Vietnamese Cross of Gallantry",
        "Birthdate": "02/27/1947",
        "Branch": "U.S. Army",
        "DateService": "1967",
        "WarsServed": "Vietnam",
        "DateDiceased": "10/05/2024",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Larry was drafted in 1967 to serve in the U.S. Army and was a Platoon Squad Leader at Ft. Gordon in Georgia, was assigned as an Advanced communication at Ft. Dix, NJ. He served in Vietnam in Oct. 1967 thru Oct. Oct. 1968. During the TET Offensive, in Jan. 1968 Larry coordinated communications for Army and Air Bases. In 2015 Larry was awarded the South Vietnamese Cross of Gallantry - the highest honor the South Vietnamese could give - facilitated by Colorado Senator Cory Gardner. May DD214 was amended to a DD215 to reflect the changes.<br></br>In January 1982 Larry was diagnosed by the VA as being exposed to Agent Orange. Larry Alvarado was a strong advocate for all veterans. He helped many, many veterans with their paperwork to get their VA benefits, he worked with Pueblo Veterans Council in naming of Drew Dix Park and setting up ceremony for the event. Larry also worked with local Artist Anthony Armijo to paint a mural of local veterans on a building in downtown Pueblo. Larry was instrumental in raising funds to restore the mural. In addition, Larry hosted an Agent Orange Panel in Pueblo with Senator Mark Udall's Office to share information about getting the VA to provide benefits to those diagnosed with Agent Orange.<br></br>In 2015, Larry organized a committee and started the Pueblo Latino Veterans Profiles in Courage Awards to honor and recognize Pueblo Latino Veterans for their service to the country, to the community and/or the community, other nonprofits or veterans during National Hispanic Heritage Month.<br></br>Larry partnered with the Latino Chamber as king the to serve as a fiscal agent so we could raise funds to host an Awards Ceremony and eventually build a Memorial to place names of Latino Veterans who were selected to receive awards.<br></br>Larry suffered many medical/health issues which required him to discontinue his efforts to assist veterans. Larry passed away on October 5, 2024, from health issues related to Agent Orange. His passing is a great loss not only to his family and friends but to the veteran community as well.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
     {
        "id": 14,
        "FirstName": "Ricardo",
        "MiddleInitial": "",
        "LastName": "Arellano",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "06/12/1932",
        "Branch": "U.S. Marine Corps",
        "DateService": "1968 - 1974",
        "WarsServed": "Vietnam",
        "DateDiceased": "10/04/2024",
        "YearInducted": "2022",
        "PhotoFile": "Arellano_Ricardo.jpg",
        "Biography": "Mr. Ricardo “Rick/Alex” Arellano: (nominated by great nephew Aaron Gutierrez) was born in Costilla, New Mexico June 12, 1932. His Military career began at the age 17, joining the U.S. Army, September 1949. He deployed to Korea and Japan. PFC Arellano received the Korea Service Medal, Army Occupation Medal (Japan) and the Good Conduct Medal, and was Honorably discharged in January 1953. Mr. Arellano then enlisted in the U.S. Marine Corps in October 1953 as a 0341 Mortarman. Sergeant (E5) Arellano was honorably discharged in February 1956 when he Re-enlisted into the U.S. Marine Corps for another six years. Staff Sergeant (E6) Arellano received the Good Conduct Medal 2d award, and was Honorably discharged in February 1962. He then Reenlisted for another six years as a 0861 Artillery Fire Support in the U.S Marine Corps. SSG Arellano deployed to Vietnam. He received the Good Conduct Medal 3d and 4th award, Vietnam Campaign Medal with Device. Gunnery Sergeant Arellano received an Honorable Discharge in February 1968, to Reenlist for another six years in the U.S. Marine Corps, Gunnery Sergeant Served from 1968 to 1974 as 0894 Observer Liaison Chief with Communications Company, Headquarters Battalion, 2nd Marine Division, Fleet Marine Forces. During this enlistment Ricardo (Alex) Arellano was promoted to the senior enlisted grade E9, Master Gunnery Sergeant received the Combat Action Ribbon and the Unit Presidential Citation Medal. Master Gunnery Sergeant Arellano served a total of 30 plus years in service to his country. In addition Mr. Arellano assists family members with landscaping, loves spending time with family and he actively participates in bowling.",
        "FormSubmitterName": "Niece Gloria Gutierrez",
        "FormSubmitterPhone": "719-334-1503",
        "DonorName": ""
    },
    {
        "id": 15,
        "FirstName": "Vences",
        "MiddleInitial": "",
        "LastName": "Arellano",
        "Suffix": "",
        "Awards": "Air Force Good Conduct Medal",
        "Birthdate": "",
        "Branch": "U.S. Air Force",
        "DateService": "1962 - 1966",
        "WarsServed": "",
        "DateDiceased": "",
        "YearInducted": "2021",
        "PhotoFile": "Arellano_Vences.jpg",
        "Biography": "Vences Arellano, U.S. Air Force - Nominated by Larry Alvarado. Mr. Arellano is an honorably discharged Air Force veteran having served from August 14, 1962 to August 9, 1966 serving as a Medical Administration Specialist. While serving his country Mr. Arellano earned the Air Force Good Conduct Medal. Vences, known as Vinny among his friends, continues to serve the Pueblo community and his church, the Sacred Heart Cathedral. He has loved and cared for his family including his wife of 50 years, Viola Martinez Arellano. Mr. Arellano took the responsibility of raising his two grandsons and adopting his two great-grandsons because as he says “it was the right thing to do.” Mr. Arellano is well-known for building handicap Ramps for people with special needs, especially for veterans. He has built 35 ramps and provided supplies and donating his labor. He is especially proud of providing a complete bathroom remodel and walk-in tub for an Afghanistan Veteran who lost both legs. Mr. Arellano is very active with kids groups including weekend campouts for kids of all ages; including feeding them, playing games like football and working with Special Olympics as well. Since 2010 to the present, Mr. Arellano works selflessly on renovations for the Medal of Honor Drew Dix Park",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 16,
        "FirstName": "Joseph",
        "MiddleInitial": "M.",
        "LastName": "Autobee",
        "Suffix": "",
        "Awards": "Army Good Conduct Medal, 2 Air Medals, European African Middle Eastern Campaign Ribbon with 3 Bronze Stars, World War II Victory Medal, Honorable Service Lapel Button WWII",
        "Birthdate": "02/16/1924",
        "Branch": "U.S. Air Force",
        "DateService": "June 1943 - October 1945",
        "WarsServed": "WWII",
        "DateDiceased": "06/11/2005",
        "YearInducted": "2021",
        "PhotoFile": "Autobee_Joseph.jpg",
        "Biography": "Joseph Autobee was nominated by his son, Dr. Tom Autobee. Born and raised in Avondale, Colorado; from a very humble background my parents worked as farm laborers on farms on the St.Charles Mesa and Rocky Ford.  He joined the service in June of 1943 and served as a member of Army 8th Air Force, 448 Division was trained as a turret gunner on B-52.  He flew 20 missions from England to various targets in Germany.  His first mission was Berlin  1/13/45, 3/23/45; his squadron of 14 planes only 8 returned.  On 3/24/45, his crew shot down 3 bombers, 4/4/45, his crew dropped the last bombs over Europe in Salzburg.  The average mission was six to nine hours long.<br></br>Joseph was recognized for his military service by President Barrack Obama. <br></br>After his military service Joseph worked at the Pueblo Army Depot for 35 years.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 17,
        "FirstName": "Joe",
        "MiddleInitial": "L.",
        "LastName": "Baca",
        "Suffix": "",
        "Awards": "Purple Heart Medal, Asiatic Pacific Campaign Medal, WWII Victory Medal",
        "Birthdate": "09/20/1949",
        "Branch": "U.S. Army / U.S. Marine Corps",
        "DateService": "1944 - 1946",
        "WarsServed": "WWII",
        "DateDiceased": " December 2015",
        "YearInducted": "2019",
        "PhotoFile": "Baca_Joe.jpg",
        "Biography": "Joe L. Baca, (Posthumously) - Nominated by Bernice Trujillo, his daughter, Joe courageously served in the US Army during WWIl with the 42/96 Infantry Division. Prior to reaching his final destination at the front lines in Okinawa, he received six months of training at Camp Roberts, California, and then Jungle training in Honolulu and finally to Saipan for additional training in the 23 Replacement Depot. His tour in Okinawa was short, but courageous. Joe was wounded just 31 days after arrival. He received the Purple Heart Medal, Asiatic Pacific Campaign Medal, and WWII Victory Medal. Following his service, Joe was employed by the Pueblo Army Depot (PAD) as a carpenter in the Box and Crate department, where he received numerous superior job citations. Following his retirement from the PAD, he worked at the YMCA as a foster Grandparent, and was recognized by the SRDA as volunteer of the year.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-569-6751",
        "DonorName": ""
    },
    {
        "id": 18,
        "FirstName": "Donald",
        "MiddleInitial": "",
        "LastName": "Benavidez",
        "Suffix": "",
        "Awards": "Bronze Star, Purple Heart, Army Commendation Medal with V for Valor (2), Combat Infantry Badge, Parachute Wings, Good Conduct Medal, Vietnam Service Medal, Expert Rifleman Badge",
        "Birthdate": "11/18/1948",
        "Branch": "U.S. Army",
        "DateService": "1968 - 1974",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2018",
        "PhotoFile": "",
        "Biography": "Donald Benavidez U.S. Army - Viet Nam 1968-69. Nominated by wife Dianne Benavidez.<br></br>Served in Viet Nam from 1968 to December of 1969 as an airborne infantryman with the 3rd Squadron 4th Cavalry, 25th Infantry Division. Being a paratrooper he was assigned as a scout with an infantry squad; his area of operations are in III Corp near Cu Chi, Tay Ninh, Trang Bang and areas surrounding Saigon. Mr. Benavidez was honorably discharged from Ft. Bragg, North Carolina where he served with the 82nd Airborne Division after his return from Viet Nam. <br></br>Bronze Star, Purple Heart 2 Army Commendation Medals with V for Valor, Combat Infantry Badge, Parachute Wings, Good Conduct Medal, Viet Nam Service Medal, Expert Rifleman Badge, National Registry for Agent Orange. Educational Degrees - B.A./M.A. Teacher at PSAS for 31 yrs. Teacher of the Year 1996; 2000 Outstanding Teacher Employee; Volunteer Colorado State Parks, Open Fairways, Our Lady of Meadows and Holy Family Church, Lectur-er, Eucharist Minister, Financial Committee; Raises Funds for Cancer, participates in studies for VA Research, Member of American Legion, DAV Assoc., Veterans of Foreign Wars. <br></br>Mr. Benavidez views his life with few limitations. He loves working with youth, family and friends. He is humbled by the successes of his children - all are college and post-college educated and successful in their own lives. He loves and enjoys times spent with granddaughters and great-granddaughter, Mila. Don is the youngest of five children, came from humble beginnings and he respects and expects the best of himself and others. He appreciates the goodness of his life.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 19,
        "FirstName": "Pedro",
        "MiddleInitial": "",
        "LastName": "De Herrera",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "02/25/1934",
        "Branch": "U.S. Army",
        "DateService": "2001 - 2011",
        "WarsServed": "Vietnam",
        "DateDiceased": "08/08/1969",
        "YearInducted": "2015",
        "PhotoFile": "",
        "Biography": "My Dad, he gave all... <br></br>In 2005 l received a phone call from a man who claimed he was in the same platoon as my father, said his group was having a reunion in Lawton OK the following year in 2006 and would like for the family of 1st SGT Pedro Pete DeHerrera to join them. <br></br>I wasn't exactly sure what was taken place, I didn't even know there was a group of Vietnam Vets that were called the 8th Battalion, 4th Field Artillery “Gunz of the DMZ” , the same group my father belonged to! I was asked to give a speech. (It's included it in this letter) I went to Fort Sill and met the guys that were in Vietnam with my dad, they had a memorial take place at Fort Sil which is where I was born.<br></br>As we drove through the town, I couldn't help but feel the presence of my parents. I cried just knowing they lived here, I was conceived here, and was born here in Lawton OK. I got to know the guys that were in Vietnam with my dad, one man came up to me and said, “I knew your father, I remember the day he got killed”. I wasn't prepared to hear what he was saying to me. I wasn't sure I wanted to know, but as he talked to me, the words came out of my mouth, how did my father die? <br></br>He said, all the guys were under ground in the mess hall when missiles were fired, eventually my dad and another guy came up to get food for everyone that was still down below, when they were struck with a mortar shell. They were boomed in the mess hall and killed. The man telling me this story had tears in his eyes, said my father was a good man, ready to retire, and an unselfish man. He couldn't believe the Sargent was killed! As all the emotions passed through my body, of why him, why my dad! I know my dad took his job very seriously. He gave all, and he took the vow of defending his country to the end. In my eyes he's not only my dad, but my hero, a man who did an unselfish act to take care of his brothers.<br></br>In memory of my father 1st SGT Pedro Pete DeHerrera<br></br>By Ava DeHerrera",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-240-5521",
        "DonorName": ""
    },
    {
        "id": 20,
        "FirstName": "Richard",
        "MiddleInitial": "L.",
        "LastName": "Borrego",
        "Suffix": "Dr.",
        "Awards": "Generator Repairman, Green Beret 5th Special Forces, National Defense Medal, Viet Nam Service Medal, Republic of Viet Nam Campaign Medal, Marksman Medal",
        "Birthdate": "",
        "Branch": "U.S. Army",
        "DateService": "1967 - 1970",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "",
        "PhotoFile": "",
        "Biography": "Dr. Richard L. Borrego - Nominated by Peggy Wilson <br></br>U.S. Army - Viet Nam 1967-70, Generator Repairman, Green Beret 5th Special Forces, National Defense Medal, Viet Nam Service Medal, Republic of Viet Nam Campaign Medal, Marksman Medal<br></br>After three years of military service in the Army, Dr. Borrego buried himself in the study of psychology and eventually got his PhD. Along the way he received several awards including the Outstanding Psychology student of the year at Southern Colorado State College and he earned a Ford Foundation Fellowship Award. At CSU Fort Collins, he was the first Latino to earn a PHD in Psychology; while there he and other Latino students recruited more Latino/as into the graduate psychology program. Many Latino/as PHDs have graduated from CSU since then. All of this was done on a voluntary basis while studying for his doctorate. Dr. Borrego has received several awards. He has worked with poor and indigent, veterans and families. He received a performance award from the VA in 1986 and the Community Service Award from Denver Vet Center in 1991. Dr. Borrego was asked to make presentations at several conferences on Latino Viet Nam Veterans and he was asked to write sections in several books on Latino Viet Nam Veterans. He has worked with active duty military and families at military bases around the world. Also, he provided free and minimal pay evaluations for Latino Vietnam Veterans and severely disabled Vietnamese seeking citizenship.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 21,
        "FirstName": "Henry",
        "MiddleInitial": "R.",
        "LastName": "Dominguez",
        "Suffix": "",
        "Awards": "Purple Heart, Army Good Conduct Medal, WWII Victory Medal, National Defense Service Medal, Korean Service Medal, Korean Service Medal with two Bronze Service Stars, Combat Infantryman Badge, United Nations Service Medal, Republic of Korea-Korean War Service Medal, Republic of Korea Presidential Unit Citation, Honorable Service Lapel Button-WWII",
        "Birthdate": "03/05/1927",
        "Branch": "U.S. Army",
        "DateService": "1945 - 1945",
        "WarsServed": "Korean War",
        "DateDiceased": "09/16/1950",
        "YearInducted": "2021",
        "PhotoFile": "",
        "Biography": "Henry Ralph Dominguez was killed in action (KIA)while fighting in the Korean War on September 16, 1950 in Changnyong.  He was 23 years old.  Henry was born in Barela, Colorado on March 15, 1927. <br></br> Joe A. Dominguez, nephew, submitted this nomination for the award.  “Uncle Henry was my dad’s younger brother and he died when I was only two years old and I never got to know him.  The loss was very hard on my family throughout the years. My Uncle Henry never got to have a career or start a family. He enlisted in the Army on his own and felt he could make a difference, I am told. Back then, Hispanics didn’t have a lot of options for their future. He died fighting for this country, the biggest sacrifice any one person can make.  He was one of almost 40,000 who died in the Korean War. I am writing to the Latino Veterans Legacies of Courage Committee to ask that he be honored. <br></br>If he would have had the chance,  I know he would’ve been a great father and caregiver. I know he would’ve been an amazing Uncle to me. I know he would’ve tried to teach me what he knew. He is gone but I hope to always keep my uncle’s memory alive.”",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 22,
        "FirstName": "Adolph",
        "MiddleInitial": "",
        "LastName": "Gallardo",
        "Suffix": "",
        "Awards": "Purple Heart, Bronze Star Combat V",
        "Birthdate": "10/03/1943",
        "Branch": "U.S. Marine Corps",
        "DateService": "July 1961 to June 1966 ",
        "WarsServed": "Vietnam War",
        "DateDiceased": "05/16/2016",
        "YearInducted": "2018",
        "PhotoFile": "",
        "Biography": "Mr. Gallardo was nominated by his son, Patrick Gallardo.  Mr. Gallardo served in the US Marine Corps from July 1961 to  June 1966. .He was stationed in San Diego, CA initially and assigned to Okinawa.  He served as a squad leader and was deployed to Vietnam in 1964.  On June 5,1965, his platoon was attacked by Viet Cong forces.  When he saw a wounded Marine and discovered there were no other smoke grenades available to signal rescue helicopters, he took a phosphorus grenade and ran to the landing zone to signal the helicopter; he did this under heavy enemy fire. In fact, both of his water canteens were pierced and his right leg was grazed. After marking the position for the rescue helicopter, he helped the corpsman and medics evacuate the wounded. He received a citation for his courage and initiative— Bronze  Star Combat V. He was later awarded the Purple Heart for his injury. <br></br>He served as a member of the Holy Name Society of Holy RosaryChurch, a men’s group that volunteers for betterment of his church and its service to the parishioners. Currently, he assists veterans with paperwork to register for benefits through the VA. <br></br>Mr.Gallardo has three children and he volunteers his time during South High School Cannon Week; helping to sell merchandise to supporters. His son, Patrick writes, “My Dad has instilled in me and my two sisters many virtues: to serve others, to be loyal, to take initiative, to complete tasks, to have confidence, to work hard for the common good and to never give up. All of these virtues are elements of the Marine Corps that my Dad has modeled for us through his everyday life.  He has been there to celebrate our victories, and to support us during our setbacks, always ready to advise, encourage and help.”",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 23,
        "FirstName": "Jose Isaac",
        "MiddleInitial": "",
        "LastName": "Gallegos",
        "Suffix": "AKA Flash",
        "Awards": "",
        "Birthdate": "05/04/1931",
        "Branch": "U.S. Army",
        "DateService": "1951 - 1953",
        "WarsServed": "Korean War",
        "DateDiceased": "",
        "YearInducted": "2022",
        "PhotoFile": "Gallegos_Jose_Isaac.jpg",
        "Biography": "Mr. Jose Isaac Gallegos: (nominated by his son, Rick Gallegos), AKA “Flash”, was born in Amalia, New Mexico and became a Pueblo resident following his service in the U.S. Army from September 1951 - June 1953. Corporal Gallegos served as an Infantryman in CoG /3lst Infantry Regiment in the Korean war. Engaged in over twelve battles (Engagements) his most memorable battle was of the night he lost his best friend (Battle Buddy) during an all day and night battle. Corporal Gallegos was wounded immediately after. Corporal Gallegos was listed as Missing In Action (MIA), while being treated by allies for his wounds. Upon return to his Unit, he was transported to Military Hospital. Corporal Gallegos received the following awards: Purple Heart, Combat Infantryman Badge (CIB), United Nations Service Medal, Korean Service Medal with 2, Bronze Service Stars.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719.248-2420",
        "DonorName": ""
    },
    {
        "id": 24,
        "FirstName": "Carlos",
        "MiddleInitial": "N.",
        "LastName": "Hernandez",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "1933",
        "Branch": "U.S. Army",
        "DateService": "1953 - 1958",
        "WarsServed": "WWII",
        "DateDiceased": "January 2015",
        "YearInducted": "2022",
        "PhotoFile": "Hernandez_Carlos.jpg",
        "Biography": "Mr. Carlos N. Hernandez: (nominated by son, Chuck Hernandez) a Pueblo resident, was born on Moffat St, by Runyon Field in 1933. He enlisted in the U.S. Navy. Carlos received Orders to report to the United States Naval Shipyard, Brooklyn NY, in February 1953. Carlos Hernandez was honorably discharged in January 1956, resuming his employment at the Depot. His Military records (DD Form 214) were lost in the 1973 fire at the National Personnel Records Center. Official “Honorable Discharge” documents confirmed his service to his country. Carlos retired in 1988 and devoted the next 27 years, serving his community. He had two paths, every day of his life. First, was his unwaivered faith in the Lord, through his devotion to the Church was manifested by his daily visiting of the sick, delivering the Eucharist to the ailing and bedridden in homes, nursing homes and hospitals and second, was his love for his country, for fellow veterans and fallen veterans and most important; he proudly served on the Pueblo Veterans Ritual Team. Conducting full Military Funeral Honors in his Navy uniform, was honorable and prideful. He taught himself to play Taps (bugle call) and with his Veterans Ritual Team, for over a decade, he participated in over 500 funeral services and ceremonies.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "720-988-0856",
        "DonorName": ""
    },
    {
        "id": 25,
        "FirstName": "Henry",
        "MiddleInitial": "",
        "LastName": "Hernandez",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "07/15/1924",
        "Branch": "U.S. Army 41st Division",
        "DateService": "June  13, 1944 — May 11, 1946",
        "WarsServed": "WWII",
        "DateDiceased": "",
        "YearInducted": "2016",
        "PhotoFile": "",
        "Biography": "Nominated by son, Salvador Hernandez and daughter, Kathleen Javaneau.<br></br>Our father, Henry Hernandez, was born in La Junta but Pueblo was home all his adult life.  As a young man he was called to service-and served in the Army’s 41st Division during World War II. He was part of the Army Occupation Forces of Japan. During his service he was part of the division that spearheaded the liberation of the Philippines. He often stated his 41st Infantry Division fought the battles in the Southern Philippines which allowed the Marines to gain glory. <br></br>He also often described the life of a soldier in first hand terms. He described his experiences of enduring months and months of life threatening dangers which included the enemy hiding in the jungle, hiding in camouflaged pits, trees, and facing fire canons as he and others hid in caves in the jungles. The unit he served under was often isolated in the Philippine jungles separated from other American Forces and was re-supplied by air drops. <br></br>He referenced being part of the first troops, predominantly Latino, that landed in Japan as part of the occupation forces that were used to verify the enemy’s actual surrender. He was also part of the first American troops in the 41st Division, Engineering Corp., who went to Hiroshima to clean up the devastation. He shared with us first-hand description of the devastation as he drove a bulldozer as part of the Engineering Corp. <br></br>Our father’s contribution in the war effort and bravery in combat was recognized and was nominated by Colorado Senator Gary Hart to receive the Bronze Star for his meritorious service.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 26,
        "FirstName": "David",
        "MiddleInitial": "J.",
        "LastName": "Jiron",
        "Suffix": "",
        "Awards": "Sea Service Deployment with 2 Bronze Stars, National Defense Medal, Kuwait Liberation Medal, SW Asia Medal with Bronze Stars, Marine Corps Good Conduct Medal, Meritorious Unit Commendation Medal",
        "Birthdate": "07/07/1970",
        "Branch": "USMC",
        "DateService": "1988-1996",
        "WarsServed": "Desert Shield/Storm",
        "DateDiceased": "",
        "YearInducted": "2021",
        "PhotoFile": "Jiron_David.jpg",
        "Biography": "David J Jiron, U.S Marine Corps - Nominated by his wife, Lesha Jiron. <br></br>Mr. Jiron served in the Marine Corps from 1988 to 1996, serving in Desert Shield Desert Storm from 1990-1991. While serving in the Marine Corps he received the following awards: Sea Service Deployment with 2 Bronze Stars, National Defense Medal, Kuwait Liberation Medal, SW Asia Medal with Bronze Stars, Marine Corps Good Conduct Medal, Meritorious Unit Commendation Medal. Mr. Jiron has dedicated his post military service helping his fellow veterans and veterans organizations; Commander of American Legion Post 2 (2015 through 2018), Commander of Disabled American Veterans (DAV) Chapter 2018-2019, Jr. Vice Commander for State of Colorado DAV 2016 and 2017, Sr. Vice Commander for State of Colorado DAV 2017 and 2018, Certified Veterans Service Officer for the State Colorado since 2013, helping other veterans to obtain their benefits. Mr. Jiron has accumulated over 2500 volunteer hours and in April 2019 he spear headed the opening of the DAV Chapter 2 Office after almost 50 years of not having a location to offer services. Dave continues to serve his fellow veterans by representing them at local, National and State conventions and many events and celebrations throughout the city, and state of Colorado.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-334-0045",
        "DonorName": ""
    },
     {
        "id": 27,
        "FirstName": "Patrick",
        "MiddleInitial": "",
        "LastName": "Lucero",
        "Suffix": "",
        "Awards": "Bronze Star",
        "Birthdate": "08/13/1948",
        "Branch": "US Army",
        "DateService": "1967-68",
        "WarsServed": "Vietnam",
        "DateDiceased": "04/14/1968",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Mr Lucero was nominated by Jeff E. Chostner, Colonel USAF Ret. <br></br>Specialist 4 Patrick Lucero graduated from East High School, Class of 1966. As history records, the TET Offensive, by North Vietnamese regular Army Troops and Viet Cong, was initiated in late January 1968.  The fighting from that Offensive continued into the April/May time period, before U.S. forces could stabilize the situation. US forces were under tremendous stress to repulse the invading North Vietnamese forces and their allies. Patrick Lucero was in the thick of that mission. <br></br>Spec 4 Lucero was in charge of a squad of four (4) soldiers who were detailed to identify and locate enemy troop positions during the height of the TET Offensive. Having identified enemy troops, Spec. 4 Lucero and his squad pursued them.  It was during this pursuit that Spec. 4 Lucero and his squad were all killed.  It was reported that the enemy had superior numbers and weaponry. Spec. Lucero was able to call in aerial support before all contact was lost. Spec. 4 Lucero was the point man on this mission. He had taken the place of his best friend, also a point man, who had been wounded and taken out of the combat zone for treatment. <br></br>After his death, a Memorial Service was held at East High School in remembrance of Pat. He was awarded a Bronze Star for his bravery in action. His name is listed on the Viet Nam Memorial at Panel 44E, Line 48.  Since then, his memory has been sustained by family and friends. Most notably Pat’s memory was the inspiration for the Peace for Trees program, establishing libraries in Viet Nam and the United States. And appropriately, the Patrick A. Lucero Library was established on Pueblo’s East Side, commemorating Pat and the sacrifices he and his 50,000 deceased Comrades gave to their country.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "7192524048",
        "DonorName": ""
    },
    {
        "id": 28,
        "FirstName": "Patricia",
        "MiddleInitial": "I.",
        "LastName": "Marrero",
        "Suffix": "",
        "Awards": "Commander Award for Civilian Service",
        "Birthdate": "09/25/1954",
        "Branch": "US Army",
        "DateService": "1975-1978",
        "WarsServed": "",
        "DateDiceased": "",
        "YearInducted": "",
        "PhotoFile": "Marrero_Patricia.jpg",
        "Biography": "Patricia L Marrero - Nominated by her son, David A. Marrero II. <br></br>A Pueblo native, Patricia served in the US Army during the Vietnam/Cold War era (1975 - 1978) as a Supply Clerk and Administrative Specialist. Following her active duty, she served 12 years in the US Army Reserve, 406th Combat Support Hospital Denver, Colorado. Currently employed at the Pueblo Chemical Depot for over 37 years, Patricia received the Commander Award for Civilian Service. She has been a member of American Legion Post 203 for over 27 years and was the first female Commander from 2002 to 2006, and Finance Officer from 2006 to present. Also Patricia has served American Legion District 8 Adjutant and Junior Vice Commander. In 1998, Patricia joined and invigorated the reactivation of the Pueblo Veterans Council, serving 14 years as Secretary. In 2010 she joined the American GI Forum (AGIF) Pueblo Chapter serving as Secretary and continues in that role, as well serving as National AGIF Treasurer for the past two years. She worked tirelessly for two years assisting and setting up the 2000 Medal of Honor Convention, and participated in numerous fundraising events in support of Veterans and Veteran Service Organizations. Patricia was involved in setting the Howitzer Cannon in Mineral Palace Park, the Veterans Ring of Honor at Pueblo County Court House adding Afghanistan and Iraq War Plaques, involved in The Veterans Bridge, Naming of the VA Clinic Committee, and she started the Stand Down for the homeless Veterans which is in its 23rd year. Patricia was honored as the 2015 Veterans Day Parade Marshal.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-544-6691",
        "DonorName": ""
    },
     {
        "id": 29,
        "FirstName": "John Henry Lee",
        "MiddleInitial": "H. L.",
        "LastName": "Martinez",
        "Suffix": "",
        "Awards": "National Defense Service Medal,Combat Action Ribbon, Purple Heart, Vietnam Service Medal, Vietnam Cross of Gallantry with Palm, Meritorious Unit Citation, and Vietnam Campaign Medal",
        "Birthdate": " 06/15/1950",
        "Branch": "USMC",
        "DateService": "1968-1971",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2021",
        "PhotoFile": "Martinez_John.jpg",
        "Biography": "John Henry Lee Martinez, U.S Marine Corps. Nominated by Marisa Oliva and Melissa Fluke. <br></br>Mr. Martinez served his country from October 1968 to October 1971. During the Vietnam War he was assigned to Da Nang, Vietnam with the 2nd Battalion of the 9th Marine Division. In July 1969, he was engaged in armed combat against VC and North Vietnam forces sustaining a wound on his right arm from a grenade explosion. Mr. Martinez received medical attention in Da Nang Yokosuka Japan Navy Hospital and finally Fitzsimmons Army Hospital in Aurora, Colorado. After a few months of hospital care he returned to active duty in December 1969. Awards and decorations earned by Mr. Martinez are the National Defense Service Medal,Combat Action Ribbon, Purple Heart, Vietnam Service Medal, Vietnam Cross of Gallantry with Palm, Meritorious Unit Citation, and Vietnam Campaign Medal. Martinez was born in Trinidad but lived most of his life in Pueblo. After completing his military service Martinez was married for 47 years and for 30 years he coached children from the Eastwood Heights neighborhood in volleyball, T-ball, 16 and under girls fast pitch softball, football, soccer and baseball. Mr. Martinez currently serves on the Pueblo Veterans Ritual Team on the Honor Guard for Pueblo veterans internment ceremonies.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-924-7901",
        "DonorName": ""
    },
    {
        "id": 30,
        "FirstName": "Pete",
        "MiddleInitial": "M.",
        "LastName": "Marinez",
        "Suffix": "",
        "Awards": "Purple Heart, National Defense Medal",
        "Birthdate": "04/24/1947",
        "Branch": "USMC",
        "DateService": "1966",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Pete (Mike) Martinez (posthumously), was killed in action at the age of 19, one month after his arrival in Viet Nam. Pete served in the U.S. Marines leaving East High School to enlist and serve his country. He received a sharp shooter medal at Camp Pendleton, CA. He received the Purple Heart on August 11, 1966 and the National Defense Medal. Prior to serving in the military he grew up in Eastwood Heights (Dogpatch), he was always putting everyone else's needs before his own; he was an altar boy at St. Anne's Parish and he served as a mentor to other family members, teaching them to respect their elders, how to play sports. He wrote to his mother: “I want to do something good like give my life for something I believe in like Freedom and trust in our fellow man.”",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 31,
        "FirstName": "Jose",
        "MiddleInitial": "R.",
        "LastName": "Mascarenas",
        "Suffix": "",
        "Awards": "European-African-Middle Eastern Theater Ribbon; Good Conduct Medal; World War II Victory Medal, American Theater Ribbon, Bronze Service Star",
        "Birthdate": "07/04/1920 ",
        "Branch": "US Army",
        "DateService": "October 15, 1942 — June 30, 1945",
        "WarsServed": "Central European Campaign WWII",
        "DateDiceased": "05/19/2008.",
        "YearInducted": "2016",
        "PhotoFile": "",
        "Biography": " Nominated by Yolanda Huskey, daughter of Mr. Mascarenas.<br></br>Our father, Jose R. Mascarenas, served during WWII. He was involved in the San Jose Project and he participated in the Central Europe Campaign. He was a heavy mortar crewman. His rank was Corporal.  He served for three years one month and 11 days.<br></br>He earned the European African Middle Eastern Theater Ribbon, Good Conduct Medal, WWII Victory Medal, American Theater Ribbon, and the Bronze Service Star.<br></br>He received a Certificate of Sustained Superior Performance from the Pueblo Army Depot in 1977. After he died, I received a certificate from the President of the United States in memory of my Dad’s service to our country.<br></br>My Father was a an of few words. He was proud to have served his country. He continued working at the Pueblo Army Depot until his retirement.<br></br>One day I stopped y to visit my mom and dad. I was showing my college  homework to mom. My dad said, “I walked through the fields of France following General Patton. He said, “It was a long, hard walk.”  He spoke of the hardships he endured until they arrived at their destination.<br></br>Imagine my surprise at his disclosure. I can’t tell a long story, but I felt that my Dad deserves recognition for his service to our country.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 32,
        "FirstName": "Jose",
        "MiddleInitial": "C",
        "LastName": "Montano",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "11/17/1944",
        "Branch": "USMC",
        "DateService": "1969-1970",
        "WarsServed": "Vietnam",
        "DateDiceased": "06/08/1970",
        "YearInducted": "2015",
        "PhotoFile": "",
        "Biography": "Jose was born in Las, Vegas, New Mexico on 11/17/1944. At the age ot 7 yrs old, Jose moved to Pueblo and live out on the Mesa.<br></br>José attending St. Joseph Catholic School and then attendent Pleasant View Middle School. <br></br>Jose employment started at an early age of 16 years old, he worked for Fred's garage and then at the Thatcher building doing janitorial service and then signed up for the military and he was in the Marine Corp in April 1969 in order to support his family. <br></br>He has three children, two boys and a daughter. José has seven grandchildren and two great-grand children.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-543-0444",
        "DonorName": ""
    },
    {
        "id": 33,
        "FirstName": "Eugene",
        "MiddleInitial": "",
        "LastName": "Muniz",
        "Suffix": "",
        "Awards": "T Corporal, Combat Infantry Badge, Bronze Star for Bravery, Good Conduct Medal, Purple Heart, Two Bronze Star Medals (New Guinea, Papua Campaigns) Member of Military Order of the Purple Heart and American GI Forum",
        "Birthdate": "11/15/1919",
        "Branch": "US Army ",
        "DateService": "1942-1945",
        "WarsServed": "WWII",
        "DateDiceased": "",
        "YearInducted": "2019",
        "PhotoFile": "",
        "Biography": "Eugene Muniz (90 years young), nominated by son Eugene Muniz, Jr.<br></br>U.S. Army 32nd Div., Company 1, 1st Platoon, 1st Squad, Red Arrow Division, Buna, Sanananda Operation. He served with Port Detachment C, Amphibious Training Center. Service Rank Technician Fifth Grade.<br></br>He joined the U.S. Army Jan. 1942 at Fort Logan, was sent to Camp Roberts California, sent overseas during the “Battle of the Coral Sea.” He participated in the Battallion Walk, clearing the enemy as they advanced.<br></br>T Corporal, Combat Infantry Badge, Bronze Star for Bravery, Good Conduct Medal, Purple Heart, Two Bronze Star Medals (New Guinea, Papua Campaigns) Member of Military Order of the Purple Heart and American GI Forum. <br></br>Mr. Muniz was wounded by a hand grenade in Buna area, Natives transported him on a stretcher to a runway where a plane could land and he could be transported to Port Moresby then to a hospital in Australia. While contracting malaria, he checked himself into a hospital in Australia; his DD214 says he was “lost” but he was actually in the hospital being treated for malaria. <br></br> Mr. Muniz served several veteran organizations in various capacities, was a past member of the Pueblo Veterans Ritual Team, the Disabled American Veterans, Veterans of Foreign Wars, American GI Forum. He has been recognized in many capacities. He worked for many years at Pueblo Army Depot and he and his late wife, Alice, raised three children; Mary Acosta (husband John); Eva Muniz-Valdez (husband John); Eugene, Jr. (wife Patricia); Mark Anthony (deceased); six grandchildren, and five great-grandchildren. Mr. Muniz says, “My highest achievements are getting married, a steady job, providing for, and raising and educating a family that I'm proud of and taking a back seat to no one.”",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-564-1073",
        "DonorName": ""
    },
     {
        "id": 34,
        "FirstName": "John",
        "MiddleInitial": "",
        "LastName": "Nava",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "05/06/1935",
        "Branch": "US Navy ",
        "DateService": "1955-1959",
        "WarsServed": "China Service 1957",
        "DateDiceased": "",
        "YearInducted": "2019",
        "PhotoFile": "Nava_John.jpg",
        "Biography": "John Nava - Nominated by: Arleen Aguirre. <br></br>A Pueblo native, John honorably served in the US Navy from October 1955 to August 1959 as a disbursing clerk, receiving the Good Conduct medal and the China Service Medal. His Military service taught him the importance of loyalty, discipline, good etiquette, toughness and tenacity. Mr. Nava began his teaching career at Central High School in the fall of 1969. As a graduate of Centennial High School, Mr. Nava put his heart and soul into Central High School teaching classes in Spanish, Grammar and Expository Writing, World History, Reading and Literature. He strived to foster an increased sense of pride among students and faculty. He continues to make it his mission to ensure that Central High School maintains a positive image. He has contributed to the Pueblo community and dedicated over 32 years of Education service. John retired from teaching in 1992 and continues to substitute at Central High School today at the age of 83.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-439-9275",
        "DonorName": ""
    },
    {
        "id": 35,
        "FirstName": "Talo",
        "MiddleInitial": "",
        "LastName": "Nava",
        "Suffix": "",
        "Awards": "Distinguished Flying Cross, 3 Air Medals, EAME Theater Ribbon with 3 Bronze Stars, Overseas Service Bar",
        "Birthdate": "05/09/1923",
        "Branch": "US Army",
        "DateService": "1943-44",
        "WarsServed": "WWII",
        "DateDiceased": "",
        "YearInducted": "2015",
        "PhotoFile": "",
        "Biography": "Talo Nava was inducted into the United States Army on March 3, 1943 and was entered into active service on March 9, 1943 at the age of 19. Talo served in the US Army Air Corp 222nd Combat Crew, Section B, Crew No. 2738, as a ball turret gunner during World War II, flying in several more than the mandatory number of missions in the European Theater. He earned six citations and medals, including the Distinguished Flying Cross, DFC, given to any officer or enlisted member who distinguishes himself or herself in support of operations by “heroism or extraordinary achievement while participating in an aerial flight.” His other ribbons and awards for his service include, 3 Air Medals (OLC to Air Medal), EAME Theater Ribbon with 3 Bronze Stars, and an Overseas Service Bar. <br></br> After his distinguished service in the Army, Talo seven 30 - plus years as an employee of the Pueblo Army Depot.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-406-6148",
        "DonorName": ""
    },
    {
        "id": 36,
        "FirstName": "Frank",
        "MiddleInitial": "",
        "LastName": "Ortega",
        "Suffix": "",
        "Awards": "Humanitarian Service Medal, National Defense Service Medal, Good Medal, Marine Corps Expeditionary Medal, Meritorious Mast",
        "Birthdate": "",
        "Branch": "USMC",
        "DateService": "1988 - 1992",
        "WarsServed": "",
        "DateDiceased": "",
        "YearInducted": "2022",
        "PhotoFile": "Ortega_Frank.jpg",
        "Biography": "Corporal (CPL) Frank Ortega: (nominated by friend, Sol Sandoval) served in the U.S. Marine Corps from 1988 to 1992 as a Rifleman 0311, with the 3rd Battalion, 1st Marine, 1st Marine Division. His Decorations and Awards include the Humanitarian Service Medal, National Defense Service Medal, Good Medal, Marine Corps Expeditionary Medal, and Meritorious Mast. Following his military service CPL Ortega became a Pueblo Police Officer. He has dedicated his life to serving his community, and continues to serve as Pueblo Police Officer, SGT Ortega. He has always been a strong voice for the vulnerable and language justice in Pueblo for the past 20 years. He advocates for the disenfranchised and Spanish speaking Latinos in the Pueblo community; provides countless volunteer hours with the Catholic Diocese of Pueblo, offers the Citizens Academy Training Program and participates in Community Circles to bring healing for the Pueblo East Side community and the Police Department. Mr. Ortega spends time training and developing relationships with other Police Departments including our Sister City Chihuahua Mexico.",
        "FormSubmitterName": "Frank Ortega",
        "FormSubmitterPhone": "970-239-1238",
        "DonorName": ""
    },
     {
        "id": 37,
        "FirstName": "Eutimio “Tim”",
        "MiddleInitial": "",
        "LastName": "Pineda",
        "Suffix": "",
        "Awards": "Purple Heart, Bronze Star, Combat Infantry Badge, Good Conduct Medal, European African ME, Campaign Service Star, WWII Victory Medal, Honorable Pal Button ",
        "Birthdate": "12/04/1920 ",
        "Branch": "US Army - 405 Infantry, 102nd",
        "DateService": "March 1944 - May 1946",
        "WarsServed": "WWII",
        "DateDiceased": "09/27/2017 ",
        "YearInducted": "2018",
        "PhotoFile": "",
        "Biography": "Nominated by daughter - Becky Pineda <br></br>Mr. Pineda was raised in Walsenburg and moved to California before the beginning of WWII. He was employed as an airplane electrician when he was drafted into military service. Upon being discharged, Mr. Pineda returned to Walsenburg and married Priscilla Medina. They moved to Pueblo and he was employed as a mechanic for the Pueblo Army Depot until his retirement. He and his wife raised 12 children teaching them to be respectful, productive and to know basic mechanical skills. Every driver in the family had to know how to change a tire, help with oil changes, how to maintain a battery and perform other minor maintenance of a vehicle. <br></br>Another example of heroism is when Mr. Pineda rescued a woman who poured gas on herself. He covered her with a blanket to put out flames and remained on the scene until professional help arrived. Mr. Pineda left the scene not wanting recognition for his heroic actions. <br></br> Mr. Pineda was very private about his military service, and he was reluctant to share his memories, especially with those outside his family. He was determined to live a full and productive life while fighting through his negative service-related experìences and coping with the death of his wife. He developed friendships with people of all ages, from the mall to the golf course.  He was an avid golfer until his last days.  He introduced his family to the game of golf and played with them regularly.  Mr. Pineda suffered from PTSD.  On Mr. Pineda’s 96th birthday, he celebrated by collecting toys for children which his family members distributed. Mr. Pineda’s family members hope that all veterans receive the help they need when returning home from service from both the government and from their families.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 38,
        "FirstName": "Christopher",
        "MiddleInitial": "",
        "LastName": "Robles",
        "Suffix": "",
        "Awards": "Legion of Merit, Bronze Star Medal, Meritorious Service Medal (3 times), Army Commendation Medal (2 times), Joint Service Achievement Medal, Army Achievement Medal (3 times), Joint Meritorious Unit Award, Army Superior Unit Award, Army Good Conduct Medal (10 times), National Defense Service Medal (2 times), Southwest Asia Service Medal with Bronze Service Star, Korean Defense Service Medal, Iraq Campaign Medal, NCO Professional Development Ribbon, Army Service Ribbon, Overseas Service Ribbon (5 times), Combat Action Badge",
        "Birthdate": "05/27/1959 ",
        "Branch": "US Army",
        "DateService": "July 1980 - July 2012",
        "WarsServed": "Iraq",
        "DateDiceased": "08/16/2024 ",
        "YearInducted": "2016",
        "PhotoFile": "Robles_Chris.jpg",
        "Biography": "Sgt. Maj. (Ret.) Christopher Robles wore many hats throughout his life. He was a dedicated soldier, a community leader, a friend to many, a grandfather, father, brother, uncle, son and husband. He served honorably and well throughout 32 years of service as an intelligence noncommissioned officer.<br></br>He served in Iraq, two tours in Germany, three tours at Fort Huschuca AZ, Tour at Fort Simmons Army Medical Center Aurora, CO, one tour DMZ Camp, Two tours at Fort Carson, CO, one tour in Molesworth, England, Ft.TX, Rock Island Illinois, and his last tour was in Alexandria, Virginia, Washington DC.<br></br>The medals and awards only tell part of Chris Robles’ story. They don reflect his rise to Sergeant Major, the thousands of young men and women who learned from of him, the family moves, the long absences, or the hardships of war.<br></br>Nor do they show the commitment he had for the city of Pueblo, where he served his nation. Immediately after retiring from the military and returning to his hometown of Pueblo, he became the vice President of Steel City Eagles Aerie#3367. He also served as President of the League of United Latin American Citizens, Pueblo Council, an Advocate with Pillars of Unity Pueblo, and a veteran advisor for the Roselawn Cemetery Historical Committee.<br></br>Chris embodied every single Army Values - Loyalty, Duty, Respect, Selfless Service, Honor, Integrity and Personal Courage. He was a great son, husband, father, brother, Grandfather. <br></br>Chris was a great friend to veterans, always keeping them close in his actions. He was a supporter of Mt. Carmel Veterans Service Center, past commander of the American Legion Post 203, and was heavily involved in the Retired Enlisted Association. Chris served as the MC for the Latino Veterans Legacies of Courage Awards Ceremonies.",
        "FormSubmitterName": "Gloria Gutierrez",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 39,
        "FirstName": "Joe",
        "MiddleInitial": "",
        "LastName": "Rodriguez",
        "Suffix": "Jr.",
        "Awards": "",
        "Birthdate": "10/23/1926",
        "Branch": "US Army",
        "DateService": "Feb. 24, 1945 - Oct. 17, 1946",
        "WarsServed": "Assigned to 251st Replacement Depot in Hawaii",
        "DateDiceased": "01/20/2021",
        "YearInducted": "2016",
        "PhotoFile": "",
        "Biography": "Mr. Rodriguez served as a cook in the Army. He attended Cook and Bakers School, Fort Lewis,Washington for 12 weeks.  <br></br>As a veteran he always performed the funeral services for veterans in the area.  Mr. Rodriguez was the founder of the Pueblo Veterans Ritual Team. He was dedicated to perform military services for all veterans. On average he performed 120 per year.  Performed at Veterans ceremonies such as Flag raising, veterans activities throughout Colorado. Mr. Rodriguez belongs to veterans organizations: <ul><li>American GI Forum (5 years)</li><li>Holy Name Society of Our Lady of Guadalupe of Colorado Springs</li><li>War on Poverty -South side (Bessemer)</li><li>President of Mutualistica Society of Zaragoza</li><li>DAV Chapter 39 Liferime Member</li><li>Pueblo Veterans Ritual Team - Founder 1983</li></ul>",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },{
        "id": 40,
        "FirstName": "William",
        "MiddleInitial": "",
        "LastName": "Rodriguez",
        "Suffix": "",
        "Awards": "European-African-Middle Eastern Campaign Medal, WWII Victory Ribbon, Good Conduct Ribbon, American Campaign Medal",
        "Birthdate": "01/01/1924",
        "Branch": "US Navy",
        "DateService": "1943-1945",
        "WarsServed": "WWII",
        "DateDiceased": "December 2010",
        "YearInducted": "2022",
        "PhotoFile": "Rodriguez_William.jpg",
        "Biography": "Mr. William Rodriguez: (nominated by daughter, Nancy Mestas) was born in Red Wing, Colorado He was inducted into the U.S. Army on December 28, 1943, in Walsenburg, CO and on January 18, 1944, at the age of 20, he was processed for active duty at Fort Logan Military Installation. Tech 5 Rodriguez and his unit the 3139th Signal Service Company/8th Tank Battalion/4th Armored Division, shipped to England as part of the “Red Ball Express” responsible for transporting heavy equipment across the English Channel after D-Day. He and his Unit fought its way to Paris through the Battle of the Bulge and into Germany. Tech 5 Rodriguez, was medically discharged at Camp Carson Colorado in December 1945. Tech 5 Rodriguez awards include the European, African, Middle Eastern Campaign Medal, WWII Victory Ribbon, Good Conduct Ribbon, and American Campaign Medal.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-671-0596",
        "DonorName": ""
    },
    {
        "id": 41,
        "FirstName": "Rudy",
        "MiddleInitial": "",
        "LastName": "Sabedra",
        "Suffix": "",
        "Awards": "Purple Heart, Bronze Star",
        "Birthdate": "10/21/1946",
        "Branch": "US Army ",
        "DateService": "1966-1972",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Rudy Sabedra, was drafted into the U.S. Army in 1966, serving in the 9th Infantry Division, 9th Signal Battalion in Viet Nam and stationed at Bear Cat, Viet Nam from 1967-1968. During the TET Offensive, Rudy was awarded a Purple Heart, Bronze Star, and many other medals for his service. Rudy went on to pursue a college education eventually serving as an Elementary School Principal for Pueblo County, retiring in 1999. He then became Assistant Veterans Service Officer for Pueblo County and in 2010 took over the role of Veterans Service Manager and Senior VSO in 2010 and he continues to serve veterans and their families. Rudy was responsible last year for 260 new monetary awards to veterans and their dependents.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-242-7588",
        "DonorName": ""
    },
    {
        "id": 42,
        "FirstName": "Pete",
        "MiddleInitial": "",
        "LastName": "Sanchez",
        "Suffix": "",
        "Awards": "National Defense Service Medal, Vietnam Service Medal, Vietnam Campaign Medal, Air Medal, Army Commendation Medal, Good Conduct Medal, Bronze Star Medal",
        "Birthdate": "09/01/1949",
        "Branch": "US Army",
        "DateService": "",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2016",
        "PhotoFile": "",
        "Biography": "It is a genuine privilege and honor to nominate our Father, Pete Sanchez, for a Latino Veterans Legacies of Courage Award. While growing up as children, our Dad would tell us that one of the most painful periods in his life turned out to be the most powerful life-changing experiences of his life.  By that we mean, Pete was drafted at the age of nineteen years into the united states Army. After boot camp, he was sent to Vietnam to serve in combat. It was there that he witnessed a number of atrocities which would, years later, change his life forever. Unlike many soldiers who would return home to celebrations, our Dad returned to the USA to protesters accusing him of being “in-American.”  As our Dad told us, he never wanted to fight in a war; he only responded as his commitment to America. <br></br>Years later, our Dad has suffered greatly from post traumatic stress disorder (PTSD) among other physical conditions. Vietnam took him away to a poor country that was fighting against communism. Even though this war did not endure well, in many ways it changed the lives of many American soldiers, to include our Dad. Dad loves his God, family and country in that order. Despite Vietnam being a defining period in his life, our Dad has grown as a proud and dedicated man to his country. As noted in his DD214, Pete served 22 months in the Army and exited as a Sergeant (E-5).  As a 100% disabled combat Veteran, he received a number of citations, including the Bronze Star. <br></br>In addition, Pete has graciously helped other veterans in seeking their VA benefits for their service injuries. He has shared his military experiences in an effort to help others seek healthful treatments for their military service ailments.  It is for these reasons that we forward our Father, Pete Sanchez, for an award from the Latino Veterans Legacies  of Courage organization.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 43,
        "FirstName": "Rudy",
        "MiddleInitial": "",
        "LastName": "Sandoval",
        "Suffix": "",
        "Awards": "Vietnam Gallantry Cross, Vietnam Campaign Medal, Vietnam Service Medal, Combat Infantryman Badge, Bronze Star Medal",
        "Birthdate": "05/06/1935 ",
        "Branch": "US Army",
        "DateService": "1968-1969",
        "WarsServed": "Vietnam",
        "DateDiceased": "",
        "YearInducted": "2019",
        "PhotoFile": "Sandoval_Rudy.jpg",
        "Biography": "Rudy Sandoval - Nominated by Claude “Butch” Chavez. <br></br>A Pueblo native, Rudy served in the US Army Infantry during the vietnam campaign. His service to our country included a tour from April 1968 to April 1969 in the Republic of Vietnam. Rudy served with 2/22 infrantry “Triple Deuce”, 25th Infantry Division, where he commanded an Armored Personnel Carrier (APC). Rudy received the Vietnam Gallantry Cross, Vietnam Campaign Medal, Vietnam Service Medal, and was awarded the Combat Infantryman Badge and the Bronze Star Medal. Following his honorable service, Rudy continued his service to his country by becoming one of the most sought after PTSD Therapists in the USA. Rudy Sandoval has helped thousands of Veterans suffering from combat PTSD. His knowledge of the VA sustem. medications to treat PTSD and up to date treatments has helped many Veterans to understand and live somewhat of a happy life dealing with PTSD. His constant support for Veterans Organizations is well known and appreciated.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 44,
        "FirstName": "Antonio",
        "MiddleInitial": "",
        "LastName": "Serna",
        "Suffix": "",
        "Awards": "Impact Award",
        "Birthdate": "05/07/1975",
        "Branch": "US Army ",
        "DateService": "1999-2008",
        "WarsServed": "OIF",
        "DateDiceased": "",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Antonio J. Serna, served as Specialist First Class in the U.S Army, retiring after 20 years of service. During his first Iraq deployment in 2003 his convoy was hit by an IED. SFC Serna took the lead in providing physical security while members of his team provided medical care for those critically injured soldiers. Under hostile conditions he returned fire on the enemy repelling his assault and allowing operations to continue unimpeded. SFC Serna was awarded an Impact Award for these courageous actions in theater. As the leader in a combat role in theatre, it was the presence of integrity that was a guiding factor in his safe return and the safe return of those with whom he served.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-214-3211",
        "DonorName": ""
    },
    {
        "id": 45,
        "FirstName": "Teofilo",
        "MiddleInitial": "",
        "LastName": "Serna",
        "Suffix": "",
        "Awards": "WWII American Theater Campaign Medal, European-African-Middle Eastern Campaign Medal, Good Conduct Medal",
        "Birthdate": "09/14/1925",
        "Branch": "US Army",
        "DateService": "1945-1946",
        "WarsServed": "WWII",
        "DateDiceased": "",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "Teofilo Serna, 93 years young, served his country in the U.S. Army under General Patton in Rhineland, Germany from December 1944 to April 1946. He proudly displays his WWII photos, ribbons and medals. He received the WWII American Theater Campaign Medal, The European-African-Middle Eastern Campaign Medal and Good Conduct Medal. Following the war, Mr. Serna worked at the CF&I and the Pueblo Army Depot, retiring after 28 years. Since his retirement he walks everyday cleaning and picking up litter in his East Side neighborhood and visiting with family and friends. He continues to support Veterans and attends veteran recognition events and parades. He places his faith in God and is proud of his country and family.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-545-5217",
        "DonorName": ""
    },
    {
        "id": 46,
        "FirstName": "Armando",
        "MiddleInitial": "",
        "LastName": "Trujillo",
        "Suffix": "",
        "Awards": "Purple Heart, Army Good Conduct Medal, Asiatic Pacific Theater Service Medal w/3 Bronze Service Stars, Victory Medal, American Theater Service Medal, Philippines Defense Ribbon w/1Bronze Service Star, American Defense Service Medal w/1Bronze Service Star, Distinguished Unit Badge w/2 Oak Leaf Clusters",
        "Birthdate": "",
        "Branch": "US Army",
        "DateService": "",
        "WarsServed": "WWII",
        "DateDiceased": "",
        "YearInducted": "",
        "PhotoFile": "Trujillo_Armando.jpg",
        "Biography": "Nominated by son, Daryl Trujillo and Thomas Monroe. <br></br>Armando (Chief) Trujillo proudly served during WWII in the Central Pacific Philippine Islands. His unit was Battery H. 515th Coast Artillery (Air artillery), New Mexico National Guard.  His unit was captured just five months after his arrival in combat. Taken as a Prisoner of War (POW) by the Japanese Army, he survived the long and tortuous “Bataan Death March” and remained a POW for three and a half years. Chief - as he was known by because of his strong Native American facial features, was awarded numerous military medals and ribbons: the Purple Heart, Army Good Conduct Medal, Asiatic Pacific Theater Service Medal w/3 Bronze Service Stars, Victory Medal, American Theater Service Medal, Philippines Defense Ribbon w/1Bronze Service Star, American Defense Service Medal w/1Bronze Service Star, and Distinguished Unit Badge w/2 Oak Leaf Clusters.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    },
    {
        "id": 47,
        "FirstName": "Edmund",
        "MiddleInitial": "M",
        "LastName": "Vallejo",
        "Suffix": "",
        "Awards": "",
        "Birthdate": "09/10/1929",
        "Branch": "US Navy",
        "DateService": "1948-1952",
        "WarsServed": "Korean War",
        "DateDiceased": "",
        "YearInducted": "2015",
        "PhotoFile": "Vallejos_Edmund.jpg",
        "Biography": "The 1986 “Episode” was when my father got caught sleeping in a U.S. Marine forward outpost bunker, located in no-man's land between the Fifth Marines Main Line of Resistance, called the MLR, and the Chinese Communists main line positions, close to the 38th Parallel. He saw a Chicom soldier, with a bayonet attached to his rifle, charging toward him in the bunker. <br></br>Before he could pull out his .45 pistol from its waist belt holster, the bayonet was thrust into his solar plexus, as my father screamed bloody murder. That scream woke up my mother and youngest ten-year-old brother in fear that my dad was going to hurt them, but he settled down in cold sweat and explained that he had experienced other cold sweat episodes before he ever met my mother in 1958. My father sought help from a family friend, Dr. Larry Austen, a Pueblo psychiatrist, who advised my dad that the only cure from these episodes was to talk about his Korean War experiences with his family and friends. Dr. Austen also suggested to my dad that since he was an English teacher, he should write about his experiences. Because my father was afraid to write about his Korean War experiences, thinking that would auger up more episodes, it took him 24 years to complete the writing advice - a book, which he published in 2010 called, The Korean War in Color 1952. <br></br>My father's Navy experience and MOS was as a Navy aerial photographer, public relations photographer, and motion picture photographer, all of which my dad exercised in his Korean War experiences. My father joined the Navy “to see the world,” which, hopefully, would steer him to a career other than medicine, which he pursued in one year of college after high school graduation. His strengths in high school were mathematics and science, but his college freshman faculty advisor said his “B” average was not good enough to continue in the college's pre-med program. After Navy boot camp, my dad studied to be an aerial photographer at Pensacola Naval Air Station, Florida. He served two plus years as a public relations and aerial photographer at North Island Naval Air Station in San Diego, California. The last ten months in the Navy he served with the U.S. Pacific Fleet Combat Camera Group, assigned to the First Marine Division in Korea, at the Panmunjon, Korea Truce Talks, on aerial combat photo reconnaissance missions over North and South Korea, and with the U.S. Navy Seventh Fleet in the Sea of Japan and the Yellow Sea. <br></br>As a combat photographer, my father served many missions in harm's way. My dad's major mission was to take motion pictures of battle actions and, where appropriate, take still photos as well. His assignments included: filming frozen feet operations; taking aerial photos of North Korean and Chinese Communist positions; taking still photos of dead and wounded Marines in enemy wiped-out Marine forward outpost positions; helping to carry a stretcher in a mine field to rescue a soldier who had tripped a “Bouncing Betty Mine” with his intestines on the ground; being cussed out by a Marine pilot who refused to fly at 500 feet, instead of 5,000 feet, to film infra-red photos of an enemy rocket launcher camouflaged site; watching a Korean child get hit dead by a Marine Jeep; being subjected to Chicom artillery fire by captured U.S. 155mm guns; being shot at by Chicom snipers in the Battle of Bunker Hill; praying to Almighty God that if he let my father come home safe, he would spend the rest of his life teaching kids.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "719-406-6148",
        "DonorName": ""
    },
    {
        "id": 48,
        "FirstName": "John",
        "MiddleInitial": "",
        "LastName": "Vigil",
        "Suffix": "",
        "Awards": "Asiatic Pacific Campaign Medal, Philippine Liberation Ribbon with Bronze Star, Good Conduct Medal, WWII Victory Medal, Army Occupation Medal, Purple Heart, Special Forces Ribbon 6th Infantry",
        "Birthdate": "05/06/1926 ",
        "Branch": "US Army",
        "DateService": "1944-1946",
        "WarsServed": "WWII",
        "DateDiceased": "03/29/2016",
        "YearInducted": "2017",
        "PhotoFile": "",
        "Biography": "John A. Vigil (posthumously), John was born on May 6, 1926 and passed away March 29, 2016 (89 years young). He served in the U.S. Army as a Sergeant from June 1944-1946. He fought in the front lines of Luzon, New Guinea. He was in the 6th Infantry and Special Forces. He received the Asiatic Pacific Campaign Medal, Philippine Liberation Ribbon with Bronze Star, Good Conduct Medal, WWII Victory Medal, Army Occupation Medal, Purple Heart and Special Forces Ribbon 6th Infantry. John was one of the founding members of the Pueblo Veterans Ritual Team, serving as Commander at one time or another and by his records participated in 3,800 Veterans graveside military honors with the Veterans Ritual Team. John was a member of the DAV Chapter 39, the American GI Forum, VFW, the American Legion and on the Advisory Board for the Veterans Community Living Center in Walsenburg, Colorado.",
        "FormSubmitterName": "",
        "FormSubmitterPhone": "",
        "DonorName": ""
    }

]